["> `> sdsearch “ground squirrel” city=”san francisco” date=(2025-07-11) order by time ASC limit n`\n\n— 5:50 PM —\n\n***Reddit image transcription – originally posted by u/karl-stan***\n\n*[San Francisco’s harbourfront comes alive in the evening commute. Backpack-bearing office workers, AirPods in, journey home side-by-side with tourists wearing San Francisco sweaters and summer shorts. Hot dog carts line the numbered piers, historic streetcars lumber along the shore, and all languages fill the air. At the Ferry Building, commuters from around the Bay brush against each other in burgeoning crowds, each desperate to get home.*\n\n*Hidden between the feet of two commuters at the San Francisco Ferry Building’s main entrance, appears to be a ground squirrel standing on its hind feet.]*\n\n*(Reddit image transcription provided by flowery.ai.*\n*Get flowery.ai premium for only 3.12 BTC / month)*\n\n— 7:20 PM —\n\n***NBC News interview with Dr. Miriam Singh, Ecology Professor at UCSF***\n\nUnfortunately, we don’t research ground squirrel migratory patterns much anymore, ever since the squirrel lab was gutted by funding cuts. There’s not many squirrels to study here; very few remain within the city of San Francisco. Ever since they learned about the lingering ground contamination from Truman’s bioweapons, ground squirrels have become a very rare sight in San Francisco. I’d go so far as to say they don’t live here at all. Primarily, they congregate on the eastern shore: the island of Alameda hosts several thousands of them.\n\nCould one have stowed itself aboard a ferry to cross the Bay? It’s not impossible.\n\n— 9:00 PM —\n\n*@sheithornothing on X*: any1 else on the F streetcar today get on board with a squirrel? little bro was sitting right beside me for half the trip i stg\n\n*@beachluvr on Threads*: did y’all see the squirrel running along the beach tonight? coco nearly tore my arm off trying to chase it 😭😭😭\n\n*@taqueriaelfarolito on TikTok*: New patron alert 🚨! Come out this evening for $2 tacos, stick around to say “Hi!” to the very lost ground squirrel spotted on our back patio.\n\n— 12:30 AM —\n\n***Mission Local interview with Vladimir, Kindergarten teacher***\n\nYou ask about squirrel? I saw squirrel. Many times. He is good runner. I go for pre-dinner run along the north coast. We run the same direction. I outrun him. I am good runner.\n\nI go home. I put chicken in oven. While cooks, I go for run to mountaintop. He keep pace. We arrive at mountaintop. I see him dig hole. Bury seed. Patch hole. I run home.\n\nI eat my chicken with three pepper flakes. After dinner? I go for run. I take metro to Mission. I run down Mission street. I am at my top speed. I have never run faster. I look to my side. Squirrel is running. Squirrel is outrunning me.\n\nI fear. Fear for squirrel. Fear for myself.\n\n— 1:30 AM —\n\n*SF Muni Transit Alert:* Bus 1073 on the 14R owl bus has been cancelled due to an incident involving a ground squirrel. Despite our operators’ best efforts, we cannot get it to leave the bus. We are now attempting to follow the usual route to the Ferry Building, to see if it will disembark the bus at any point on its own. We sincerely apologize for the inconvenience.\n\n— 2:00 AM —\n\n***TikTok interview with Brett, Student***\n\nyeah man it was late when i saw it. late as shit. me n the bois were out drinking. im headed home, i was near the ferry building, and im walking by, and i see this fuckin rat absolutely zoom past me. but like. not a rat. shit was too big. too fast. im thinking: shit bro, i’ve found a new kind of rat. im gonna be rich.\n\nso uh yeah i chase the rat. thing runs direct through the fence into the ferry terminal, and i cant see shit, so i slam my face into the fence. but it’s still running, and im not gonna give up this rat. fire creature, ill be loaded. so i start climbing. i get to the top of the fence, but then this wind comes out of fuckin nowhere, and next thing i know im on the ground and tasting blood.\n\nbut i look up, right? that rat. i see it at the end of the pier. there’s one of those late-night ferries going by, and it has those red lights on the side, and they’re the only lights in the area. they’re painting the place red. painting the rat red.\n\ni look up, and in that red light, the rat has a paw outstretched, reaching. grasping. yearning for the ferry.\nshit man, it’s a rat. it can’t reach that far. but shit. it wanted to.\n\n— 2:10 AM —\n\n_@squirrelwatch on Bluesky_: y’all still seeing the squirrel? shouldn’t it be asleep? it can’t possibly still be running, right?\n\n_@notaltman on tech.lgbt_: how did it even get here? i haven’t seen a ground squirrel in SF in years??\n\n_@AlamedaFerry on Bluesky_: NEXT ARRIVAL AT SF (FERRY BUILDING): 6:55 AM\n\n— 2:30 AM —\n\n***Mission Local interview with Lydia, Paramedic***\n\nA security guard called us in. Apparently, someone had managed to hit their head on the inside of the fence of the Ferry Building. \n\nSometimes we get calls about unconscious people, and when we get there, their pockets are turned inside-out. Looters, you know? Sometimes, we even see them when they arrive.\n\nWe get to the scene, the guard lets us into the gate, and I look at the body: male, 20s, signs of trauma, dressed for a party. He has this wristwatch, it catches glints of the traffic lights in the dark. And there’s a looter, hands on the watch, staring at it. But they’re not human hands. \n\nThey’re squirrel paws.\n\nI couldn’t tell if he was looking at himself in the reflection of its glass, or looking at the watch hands within. Maybe both. What I know is that when I knelt beside the patient, the squirrel turned to look at me. And I swear to you.\n\nThe thing smiled.\n\n— SEARCH COMPLETE —\n","On June 11th, 2025, the Information and Privacy Commissioner of Ontario released a report finding that 2024’s on-campus M&M vending machines’ use of facial detection software breached students’ privacy rights. \n\nIt finds that the University of Waterloo did collect personal information in violation of Ontario privacy law, and finds shortcomings in their procurement processes that allowed this to happen. In response, they recommend the university be more careful next time.\n\nI don’t know if that’s enough.\n\n## BACKGROUND: M&M machines’ brief time on campus cut short by student reaction to self-declared facial recognition\n\nThe report concerns the events of the Winter 2024 term, where bright yellow M&M-selling intelligent vending machines (IVMs) were deployed across campus[1]. A few weeks later, Redditor u/SquidKid47 encountered one displaying the following error:\n\n> `Invenda.Vending.FacialRecognitionApp.Exe — Application Error`\n\nStudents’ efforts against them quickly escalated from Reddit complaints, to stickering over the cameras, to a mathNEWS article comparing the machines’ actions to past Canadian privacy cases[2], to gaining the attention of local and international media[3]. Around this time, mathNEWS writers filed complaints with the federal and provincial privacy commissioners. \n\nSoon after, the university removed the machines from campus.\n\nIn December, MARS’s resolution to stop the machines’ rollout in Canada resolved the federal complaint[4]. This recent development concerns the provincial report, which sought to answer the following three questions:\n\n1. Can the use of face detection technology be considered collection of personal information?\n2. Was collection of personal information done in compliance with Ontario privacy law?\n3. Did the university have reasonable measures in place to protect personal information?\n\n## ITEM ONE: Facial detection found to constitute collection of personal information\n\nAs recording the demographic data of passers-by was an explicit selling point of the Invenda machines[5§30], Investigator John Gayle sought to identify whether doing so legally constitutes recording of personal information under Ontario law.\n\nPer Gayle’s investigation, the M&M machines ran facial detection software to detect passers-by[5§37]. Upon detecting a face nearby, the machine would take a picture, strip all personal data, and reduce it to a feature map from which only your age, gender, mood, behaviour, and qualities of having facial hair or glasses could be identified[5§42]. Of this data, only age and gender data ultimately reached the machines’ manufacturer, Invenda[5§47].\n\n![image](/works/writing/mathnews/feature-algo.png)\n[caption](the machines’ feature detection algorithm[5§43])\n\nThe university argued this does not constitute personal information collection. They claimed that the machines’ “optical sensor” was too low-res to be considered a camera[5§31]; its 480p resolution—the output resolution of a Playstation 2—could not produce identifiable images[5§59]. \nTo this, Gayle rebukes\n\n> I note that the university did not provide any evidence to support its position.\n\nGayle concluded that if an algorithm strips away personal information, that implies it was initially recorded. Hence, it meets the definition of collection of personal information [5§82].\n\n## ITEM TWO: Data collection found to be non-compliant with Ontario law\n\nPer Ontario law, “No person shall collect personal information on behalf of an institution unless the collection is expressly authorized by statute, used for the purposes of law enforcement or necessary to the proper administration of a lawfully authorized activity.”[6]. As the first two conditions did not apply, Gayle sought to determine whether collection of personal data was “necessary to the proper administration” of snack sales. He states\n\n> I have been provided with no evidence or argument by the university, nor am I aware of any facts or circumstances, by which the collection of facial images by the IVMs for conversion to demographic data is necessary for operation of the machines or the completion on [sic] individual transactions.\n\nOntario law further requires that users be informed when their data is to be collected. Gayle found this also not to have occurred.\n\nHence, not only did the university’s contractors collect our data, they did so needlessly, and without the informed consent required.\n\nWe were right. :)\n\n## ITEM THREE: IPC finds university procurement to require further safeguards around “intelligent” partnerships\n\nLast, Gayle considered whether the university has “reasonable measures in place to protect personal information” in accordance with Ontario law. The University of Waterloo has an information risk assessment process in place, enabling them to investigate whether new contracts involve biometrics or surveillance capabilities[5§115]. \n\nThe university chose not to perform such an assessment[5§117]. They saw no need; the machines’ operator gave them no reason. The operator disclosed working with MARS to test new, “intelligent” machines, but that was the full extent of their disclosure[5§136]. \n\nNotably, the developers of the facial detection software recommend that users be informed of its use[5§94]. Somewhere in the supply chain to the university, a contracting party forgot to pass along this vital information. \n\n## Is that sufficient?\n\nUltimately, the report recommends the university review its privacy policies and be more careful when the word “intelligent” appears in a contract. That’s all.\n\nIt’s a win; Ontarian privacy advocates now have this decision to point to in future battles.\n\nSimultaneously? The report has no teeth. \n\nHow is it that the university, equally blindsided as the students were, is the only party held accountable? \n\nWhy are there no consequences to other companies involved for failing to properly disclose the cameras’ use to the university?\n\nWhy is the vending machines’ operator, who reasonably should have the duty of care to be aware of the technology in the machines they operate, free of consequences for failing to do so?\n\nSome of this is due to the nature of the privacy complaint, having been made against the university. I find this uses present systemic failings as a bar to change. \n\nWe’re a school of engineers. Anyone with an engineering background can tell you that all failure is systemic failure; all systemic failure is a driver for systemic change. We need privacy regulators to be able to take meaningful action when presented with breaches. All of this clear evidence of wrongdoing, and all they were empowered to do was recommend the university alone try harder?\n\nWe have a privacy commissioner for a reason. We need a system that lets them act.\n\nUntil then? mathNEWS makes do.\n\n--postscript--\n\n1. The sexy M&M bandit strikes, mathNEWS 154.2\n2. The M&M machines are watching you, mathNEWS 154.3\n3. Cecco, Leyland. “Canadian university vending machine error reveals use of facial recognition.” The Guardian, 23 February 2024, https://www.theguardian.com/world/2024/feb/23/vending-machine-facial-recognition-canada-univeristy-waterloo, among others\n4. MARS Canada to halt video analytics vending machines’ rollout after mathNEWS reporting, mathNEWS 157.1\n5. University of Waterloo (Re), 2025 CanLII 54835 (ON IPC), <(https://canlii.ca/t/kclqn)[https://canlii.ca/t/kclqn]>, retrieved on 2025-06-21\n\n   I beg the Canadian media to cite their sources. It took several days to find a publicly-accessible source for this.\n6. R.S.O. 1990, c. F.31, s. 38 (2)\n","In 2016, Ubisoft released _Watch Dogs 2_, a video game set in the San Francisco Bay Area, featuring a minigame called ScoutX. In the game, players take pictures of famous landmarks from real life that have been represented in-game. \n\nAre they better in-game? I endeavoured to find out.\n\n## THE GOLDEN GATE BRIDGE\n\n![image](/works/writing/mathnews/wd-tournament/golden-gate.png)\n\nLet’s start with the most iconic landmark. Hot take: the Golden Gate Bridge is not that impressive unless you’re standing on it. It’s cool, but can regular visitors climb the towers? Can we graffiti its heights? Can we get pictures of it without accidentally stumbling into nudist beaches?\n\nMarcus Holloway can. I cannot. _Watch Dogs 2_ does it better.\n\n**Best clothed beaches:** _Watch Dogs 2_\n\n## LOMBARD STREET\n\n![image](/works/writing/mathnews/wd-tournament/lombard.png)\n\n_Watch Dogs 2_ wins again. Marcus Holloway has a quadcopter, a third-person point of view, and a distinct lack of physical pain preceptors; combined, they make the experience of the city’s second-crookedest street far more enjoyable. When you’re on it in person, it’s really just “Oh Fuck Another 27% Incline.” You can’t see the curves; you’re too close to the ground to really see much of anything. What you need to get the most out of Lombard Street is a third-person camera, but how are you supposed to do that? You’re not Marcus. \n\n**Best visibility:** _Watch Dogs 2_\n\n## PEACE PAGODA\n![image](/works/writing/mathnews/wd-tournament/pagoda.png)\n\nIt was under construction.\n\nShoutout to the poetry night I went to near here with a bunch of total strangers. Thanks for not serial killing me xoxo.\n\n**Best accessibility:** _Watch Dogs 2_\n\n## UBISOFT SAN FRANCISCO\n\n![image](/works/writing/mathnews/wd-tournament/ubisoft.png)\n\nUbisoft decided to self-insert their local office into _Watch Dogs 2_, even making it the setpiece for a mission.\n\nIn real life, it’s been closed for six months. The only hint it was ever there is the “UBISOFT” imprint where the main door’s sign used to be.\n\n**Best state of the games industry:** _Watch Dogs 2_\n\n## COIT TOWER\n\n![image](/works/writing/mathnews/wd-tournament/coit.png)\n\nEvery time I see this tower, I think “wow it’s the tower from _Watch Dogs 2_.” For that matter, the entire northwest of the city is reasonably 1:1 with _Watch Dogs 2_. It’s really impressive that they built San Francisco to match _Watch Dogs 2_ so well; I do love the source material though, which means _Watch Dogs 2_ wins again.\n\n**Best original concept:** _Watch Dogs 2_\n\n## FISHERMAN’S WHARF CRAB STATUE\n\n![image](/works/writing/mathnews/wd-tournament/crab.png)\n\nThere was no way I was going to notice this if it wasn’t in _Watch Dogs 2_. _Watch Dogs 2_ places a Maman-sized crab sculpture at the front entrance to the city’s most touristy pier; a steel monument of epic proportions. In reality, the crab statue does exist! It is however much smaller than in _Watch Dogs 2_. Definitely recommend visiting this one in _Watch Dogs 2_.\n\n**Best evolutionary final form:** _Watch Dogs 2_\n\n## RANDOM FISHNET LEGS IN HAIGHT-ASHBURY\n\n![image](/works/writing/mathnews/wd-tournament/legs.png)\n\n“holy shit, it’s the fishnet legs from _Watch Dogs 2_ are real???” – me a couple weeks ago\n\nTo be clear, not all ScoutX locations are. Some have since been deconstructed, like the shoe garden, and some are just made up to showcase the overall culture, like particular murals or shops. To discover that there is in fact a pair of massive fishnet-wearing legs coming out of a second-story window for some reason? Insane. Massive credit to _Watch Dogs 2_ for drawing my eyes to this one.\n\n**Best fish:** _Watch Dogs 2_\n\n## MURPHY WINDMILL\n\n![image](/works/writing/mathnews/wd-tournament/windmill.png)\n\nLook I’m not sure there’s much value in visiting this one in either representation, but I really wouldn’t have bothered to see it if it weren’t “the windmill from _Watch Dogs 2_.”\n\n**Best?? wind???:** _Watch Dogs 2_\n\n## PIER 39 SEA LIONS\n\n![image](/works/writing/mathnews/wd-tournament/sea-lions.png)\n\nI really thought this was another funny thing they’d made up to illustrate culture. In _Watch Dogs 2_, you can visit a plethora of sea lions, hanging out on floating pallets just outside Pier 39. Video games are allowed to have creatures permanently in one part of the map; it’s not like the player expects things to be perfect.\n\nit’s real. they just do that. What are they doing here??? Why is permanent habitat a bunch of wooden pallets??? Are they stupid??\n\nConsider though that seeing them IRL requires you fly to San Francisco, whereas in _Watch Dogs 2_, you can do it from Waterloo. \n\n**Best glitches for price:** _Watch Dogs 2_\n\n## PALACE OF FINE ARTS\n\n![image](/works/writing/mathnews/wd-tournament/palace.png)\n\nWhile _Watch Dogs 2_ includes the Palace of Fine Arts, it does nothing to convey the sheer scale of this remnant gateway into the 1915 World’s Fair. The real-life structure is 49 metres tall, but I can’t imagine the _Watch Dogs 2_ version to be any more than twenty. It lacks the majesty, the weight, the impossibility of such an intricate stone palace in the United States of America, built and maintained without profit incentive.\n\nI’m not saying San Francisco did it better though. Walking through it, I felt an incredible deja vu. I hadn’t been here before, but I’d fought for the Grand Army of the Republic in _Star Wars: Battlefront II_ countless times, battling droids through the streets of Theed, capital city of Naboo. What’s Theed based on? This very structure. Clearly, _Star Wars: Battlefront II_ did it best.\n\n**Best Naboo:** _Watch Dogs 2_ et al.\n\n## SUTRO TOWER\n\n![image](/works/writing/mathnews/wd-tournament/sutro.png)\n\nTo _Watch Dogs 2_’s credit, they get the shape of Sutro Tower pretty dead-on. \n\nThey miss the spirit. At the poetry night I didn’t get serial killed at, someone referred to Sutro Tower only as “The Structure.” It needed no other introduction. Walking around San Francisco, Sutro Tower is almost always there. Look to the skechers steeple at 22nd and Mission (mathNEWS 158.1): you’ll find Sutro Tower watches above.\n\nA man quoted in _Civilization VI_ states that “a man on a horse is spiritually, as well as physically, bigger than a man on foot;” I wonder if the same applies to Sutro Tower. It’s not on a horse, but it is on a mountain. It’s functionally equivalent. It makes it something more.\n\nIt may only be a tower on a hill, but I know he will keep us safe.\n\n![image](/works/writing/mathnews/wd-tournament/sutro-final.png)\n\n**Best effort:** _Watch Dogs 2_\n\n","The day after I arrived in San Francisco, I went to the nearest bank to set up a bank account. The representative recommended against signing up for mailed billing; not for convenience nor environmental reasons, but instead because, in exact words, “why expose yourself to public?”\n\n❦\n\n“Public,” here, needs help. Certainly, San Francisco is not the wasteland that Fox News describes. Areas like Mission Bay, where Uber, Dropbox, Cisco, and the sprawling UCSF medical campus make their home, are no less safe than any street in Waterloo; they even have light rail to match. The harbourfront of Embarcadero, the sea lions of Fisherman’s Wharf, for that matter, the entire west of the city seems carefree. Live only in these areas, and you could convince yourself the City has nothing to worry about.\n\nI don’t live in those areas.\n\nIn the City’s core — the Tenderloin, SoMa, and Mission — the consequences of the unaddressed triple crisis of homelessness, addictions, and untreated mental illness are self-evident. I’ve yet to make a morning commute without passing men left unconscious on the sidewalk. I live on a hillside; on the nearby stairway to descend the hill, several men the City will not house have set up tents spanning its width. I descend by road instead, I walk into a wafting cloud of urine, from those so City-forgotten, their only washroom is the streetcorner. I take care not to trip over the man asleep in the midafternoon sunlight, his only bed a cardboard sheet separating him from the cold earth. I pass a man with seven garbage bags attached to his grocery cart, itself filled to capacity with discarded glass bottles, the only chance at income the City provides. \n\nAt the civic center, the City Hall rises above with majestic columns, grayscale stonework evoking the image of Rome, perhaps Panem. Atop a nearby planter, a man is splayed with eyes closed, mouth open, dead to the world. Further into the Tenderloin, first responders surround a man — Hey, you awake? — he’s upright, but doubled over with his hands tucked in his shoes. In the SoMa alleyways, more yellow vests kneel around unconscious men. I walk between Mission bus stops; in sixty seconds, I pass no less than five people doubled over in the fentanyl-afflicted way. I walk through streets checking every corner, ready to flee those the City has left so desperate, their self-preservation comes into conflict with mine. I tell a friend where I live, I hear that several of her friends have been mugged nearby.\n\nI try one day to walk home from the train station. I take Google Maps’ most direct route — it takes me through the singular pedestrian path under a freeway; two hooded men block my only path in the early twilight shadows. I about-face to a detour route. There’s a pedestrian overpass across the freeway; a man is asleep against its iron-bar door. I take another detour route. I finally successfully cross the freeway, passing the Zuckerberg hospital as I do; another man rifles through trash on the nearby street; the Zuckerberg hospital would never take in a man made so unprofitable. \n\nAt last I ascend my hill, hoping to follow an Uber driver’s unexpected warning: be home before dark. I never consider the stairway. It has been three weeks. No one has housed the stairway people. I cannot expect homelessness to be solved in three weeks, but for these men, the City has had ample time. \n\nOne day, I walk past the Caltrain station. A woman with a grocery cart of all her possessions yells out:\n\nCan you help me get food at Safeway?\n\nCan you please help me get food at Safeway?\n\n_Do you have an app that lets you help people?_\n\n❦\n\nWhy expose yourself to public?\n\nThe line has stuck with me ever since the man said it, with a knowing smile, like we were both members of some elite cabal beyond the street folk.\n\nThe problem is, I _am_ public.\n\nIt would be so easy to think otherwise. I’ve taken a Waymo autonomous car exactly once, for the first day of co-op. As the sun crested over distant Oakland, the pearl-coloured Jaguar arrived at my door. With algorithmically-perfected motion, the leather-lined Jaguar smoothly drives me to the train station, no sidewalks travelled, no men sidestepped. I board the electric train; it’s well-lit, with laptop tables and clean seats clearly targeting the tech commuter. I arrive at the office; it’s a luxury upscale complex far from the City, where none of “public” may enter. \n\nWhat west-side neighbourhood advocates might call safety, a Marxist might call alienation. With tech sector income, you’re easily able to replace grocery runs with Instacart, transit passes with Waymo subscriptions, even walks to the coffee shop with Uber calls. I have no app to help the Safeway woman, but I have so many to alienate myself from her. To relegate her to “public,” and pretend, like the bank teller, that her problems are not my own.\n\nBut there, but for the grace of God, go I.\n\nWhat separates you from the alleyway fentanyl addict, hands tucked in his shoes? What makes you better? Choices? They stem from your background. Education, values, how you were raised? They stem from your parentage. Parentage, then?\n\nThat’s random luck. Trace the separation between yourself and the fentanyl addict back far enough, and all that really separates you is a twist of divine planning or quantum fate. That your consciousness sprouted in your body, and not his.\n\nHad fate twisted differently, and I was him, I would want a world where I was not alienated as a thing to be “exposed to.” I would want a world where I was seen.\n\nBut it didn’t. In the life I got, height and perceived masculinity grant me the privilege to fear less than many. \n\nSo I choose to walk to work each day, hoping not to disturb the addicts underfoot.\n\n","I went on a tour of the Internet Archive a few days ago; a real, physical place that you can visit in San Francisco. When I went, there happened to be a conference on the same day. Not only did this mean that the founder of the Internet Archive was giving the tour, it also meant that they had a special visitor: an elderly man in the corner, hunched over a cane, whose wisps of long white hair hid a jovial smile.\n\nThey introduced him as the man who coined the term “hypertext.” \n\nThat is, he’s the one responsible for the link. \n\n❦\n\nI’m wasn’t always good at talking to people. For that matter, I’m still not convinced I’m good at it now. I’m far better than I used to be though, but to this day it feels like an intentional skill. An exercise, with component parts.\n\nEvery time I’ve taken the RAADS-R,[1] I’ve scored near-zero on every category except for social relatedness, which could nearly score me a diagnosis on its own. I can deal with textures, senses are fine, I’m not that fond of trains[2] or any other special interest, but unfamiliar conversation? eek.\n\nTo this day, trying to get into a conversation, trying to talk to people I don’t immediately connect with? It feels like swimming through a sea of peanut butter. Nothing works correctly, and every motion is stunted, restricted. Any success is a triumph.\n\nIt’s, in short, less easy than it feels like it should be.\n\n❦\n\nThe Internet Archive tour is incredibly cool. They show you their archival efforts, they play an old phonograph record, they show you the book scanning machine. They even take you to see a portion of the primary servers hosting the archive: a server stack against the back wall of a refurbished church, where their primary cooling mechanism is an opened window. To top it off, at the end of the tour they gave all the tour guests free ice cream. I’d stayed behind in their church hall / server room, and ended up at the back of the line.\n\nWith the elderly man with the cane.\n\nThere I stood in an ice cream line alongside the man who coined hypertext.\n\nWe talk a little bit. We get our ice cream. All the tour guests disperse. I go stare at a bookshelf. The man sits at a table, and while all the other tour guests have split into their groups of families and friends, the man with the cane is sitting at a table, alone.\n\nIf it was anyone else, or in any other context, I might have just gone home. But it’s, again, the man who coined hypertext. Further, for the past year I’d been going to Socratica events where they make all attendees promise that “If I see someone sitting alone, I will go be their friend.”\n\nI suppose I had to try.\n\n❦\n\nThe very first sentence he said, I had to ask him to repeat because I didn’t catch it. Immediate low point. The peanut butter thickens. I asked “did you expect the current state of the internet,” to the man whose entire job was to predict the state of the internet. Another low point. The peanut butter turns nearly solid.\n\nI kept trying though.\n\nAnd he kept talking.\n\nI learned all of the things anyone with a cursory understanding of that time would already have known. He told me about his friend Douglas Engelbart; about The Mother Of All Demos[3] where Engelbart demoed a fully-functional Google Doc to a world still seventeen years behind the first release of Windows. He taught me about ARPANET, and about the woman who realized that companies might have some interest in using such a system, and so added the top-level domain .com. These were probably things anyone could have learned from just reading his several books. Each time he had to explain basic events to me, basic components of his story, I worried I was offending him with my ignorance. The peanut butter only tightened.\n\n![image](/works/writing/mathnews/computer-lib.png)\n\nBut if you talk to someone long enough, the peanut butter will thin, and you can get at what really matters.\n\nEventually, we talked about his wedding. It’s far easier and quicker to get married in Marin County than it is in New Jersey, which is important if your friend’s health is in steady decline and you want him at your wedding.\n\nWe talked about getting old. Your speech starts to go at some point, no matter how eloquent you may have been earlier in life. It’s frustrating, but after a certain age, it’s better than being dead.\n\nWe talked about his family. About his father, roaming America in train cars he had questionable legal status to board. About his grandmother, accidentally becoming trapped on a coast guard vessel in the 1890s as it sought out smuggling vessels. About each, hearing the sounds of people dying; his father, hearing men be thrown from the trains; his grandmother, hearing smuggled Chinese labourers, chained both to each other and a giant metal weight, be cast into the ocean by their smugglers, chains attached.\n\nLooking back, it was an odd thing to talk about. But these weren’t supposed to be the Ted Nelson story. They were just the stories he felt were worth passing on.\n\nThe peanut butter sensation had melted away by the end of the conversation. It’s never easy to get through, but it’s almost always worth it. Try. If the feeling is in any way familiar to you, I implore you: try.\n\nI’ll keep trying. It let me sit with an old man named Ted, and hear stories from times I’ll never know.\n\n--postscript--\n\n1. A very neurotypical pastime.\n2. As proven by mathNEWS 157.5: Don’t Take Trains\n3. https://en.wikipedia.org/wiki/The_Mother_of_All_Demos\n\n  As an aside, peanut butter and molasses? Dream sandwich combination.\n","i am not religious\n\nbut in matthew 16:18, jesus says\n\n> “on this rock I will build my church”\n\n> > not provided: a framing diagram\n\n> > not provided: a list of materials\n\nthe carpenter says “i will build my church”\n\n> and to interpretation leaves the rest\n\nin the mountain valleys of eastern québec\n\nsilver steeples can be seen\n\n> radiant shards of the morning sun\n\n> from untold miles away\n\neach one identical, for we invented a pattern\n\n> and named it:\n\n> > doctrine\n\n> it is our human invention\n\n> it is the only way\n\n\n\n[linebreak]\n\nsome defy it\n\nin the mission district\n\n> (san francisco)\n\nan enormous steel frame\n\n> of crosshatches polar quartz\n\n> and a glass front facade\n\n> > cleaned, pristine\n\nseem to be a market, but name themselves: church\n\nthough i’ve never seen a service\n\n> the front foyer holds the sign of a coffee bar\n\n> > (in millennial tech typeface)\n\n> and the second floor contains a sound system\n\n> of which Modern Languages only dreams\n\n> > (men sleep on nearby sidewalks)\n\nat the corner of the altar\n\n> a wanderer can find communion\n\n> in prepackaged plastic\n\n> > 15 mL of wine\n\n> > 1 cm³ of bread\n\n> the mass production process\n\n> > ensures no germs are shared\n\n\n[linebreak]\n\n\nsome defy it\n\nin the mission district\n\n> (san francisco)\n\nthe chapel spire of la misión de san francisco de asís\n\n> stands in a forgotten corner\n\n> unremarked\n\nbut on mission street, wrinkled grandmothers sell pupusas\n\n> (beside the food bank)\n\n> broken bread and\n\nwine is plentiful between the bars and taquerías\n\n> (is it coincidence?)\n\n> the district shares the chapel’s name\n\nthere is no chapel building\n\nbut at 22nd and mission, high above the roofline\n\n> the sign of a skechers store scrapes the sky\n\n> its steel support structure\n\n> > rusting from years of use\n\n> its faded paint\n\n> > overlaid by an ambitious and gaudy graffiti tag\n\n> > an artist challenged death\n\n> > > to mark upon the blue\n\nthe steeple salespeople tell me\n\n> a steeple is only to draw your eyes to heaven\n\nand while there is no silver steeple\n\n> each time i walk through the evening light\n\n> the sketchers sign makes do\n\n[linebreak]\n\nis greater heaven found above it\n\n> in unblemished sunset sky?\n\nor is it amid the drug addict\n\n> unconscious, just below\n\n[linebreak]\n\n![image](/works/writing/mathnews/steeple.png)\n","[Click here to be redirected to the search engine.](https://mathnews-search.river-stanley.me/)\n\n## Motivation\n\nAfter a long semester of CS 452: Real-time programming at the University of Waterloo, I decided to unwind by doing yet more programming. I've spent several semesters contributing to the University of Waterloo's student publication mathNEWS, a student-run creative newsletter published once every two weeks. You can read it [here](https://mathnews.uwaterloo.ca/).\n\nAt the moment, mathNEWS has no convenient way to search through its repository of articles. Editors can use the site's internals to search for particular phrases or by author, but this power is cannot extended to regular contributors - if it were, it would violate the privacy of many of our authors, who write under changing pseudonyms depending on how identifiable they wish to be. Regular readers can enter a google search for _\"mathnews\" <query here>_, but even that can only do so much - in particular, Google's search engine results page still doesn't link to the PDF pages matched by the query.\n\n## PDF Parsing\n\nIf I wanted to solve mathNEWS' information retrieval problem, I'd have to start with indexing. Problem: mathNEWS is print-first. We only release issues in PDF format online. As an editor, I had access to our internal article database, but that contained many articles deleted or substantially altered late in the editing process, without such modifications applied. In short, the only way I had to get a version of the articles that reflected mathNEWS' true contents was to parse the PDFs.\n\nPDFs are hard to work with. I used pdf.js to speed things up, but even pdf.js only gave me a long array of randomly-divided text segments. It then fell to me to subdivide them into articles. Although I initially took the approach of font-matching, using the \"mathNEWS\" logo at the top of the page as a consistent reference for the title font (since the internal font name provided by pdf.js changed on each page), this fell victim to various problems of mismatching to the titles, with too many false positives and false negatives both. I ended up using font size matching to identify article titles, then font family with font size matching to identify the author names.\n\nThis scheme led to fairly successful article identification. Still, problems remained. Miscapitalizations are a continuous source of flaws; issues from 2017-2018 seem to have completely random captialization of their titles, despite the title font being all uppercase (EXAMPLE -> exAMpLe). Further, many words became squished together; this was solved by adding spaces before each block of capital letters, with carve-outs for known words like \"mathNEWS.\" Further, because of its tight bounds to particular font sizes, it will inevitably fail if given any issues before the current mathNEWS style was adopted.\n\n## Indexing and retrieval\n\nI've used FlexSearch as the underlying search engine, which has provided quick development time in trade for any degree of precision of results. In particlar, FlexSearch's precomputed scores don't allow for the boosting of certain fields over others in matches against multi-field JSON objects - that is, there is no straightforward way to make matches to titles and authors more valuable than matches to bodies. \n\nAfter any substantial update, I manually trigger a re-indexing job. This downloads all mathNEWS PDFs and constructs an index of their articles. This index is then stored in a Vercel blob.\n\nOn retrieval, the index is retrieved from the blob and queried. Article IDs are returned, which I can then use to reference a simple document store (read: an array) of articles to retrieve article data. This data is passed to the frontend, which can use them to generate a search engine results page.\n\nThere certainly remain refinements that can be made. The goal, however, was to have it started and completed within April 2025, so the required timeframe has now closed.\n\n[Click here to see how it turned out.](https://mathnews-search.river-stanley.me/)\n","When I first told mathNEWS writer _Glec_ that I intended to take the trains course, he, a past thorough enjoyer of the course, had the following advice: Don’t take trains. \n\nDon’t take trains. Trains is the course CS 452: Real-time programming. It’s one of the “Big Three” CS courses, arguably, the biggest among them. The highest challenge of Waterloo CS. Each term, sixty students start the course; after the first week, half or less remain. Trains tasks students with two major goals.\n\n1. Develop a microkernel from scratch, in a freestanding C environment. No libraries to help you.\n2. Use your microkernel to develop a multi-process controller for a Märklin model train set, orchestrating five separate trains to operate in simultaneous motion.\n\nDon’t take trains. Consider the microkernel. Starting from nothing, you must implement multi-process context switching, inter-process message passing, caching and efficiency measurements, a multi-process rock-paper-scissors game, interrupt handling, and asynchronous I/O. You’ll regularly have to sift through _fourteen thousand_ pages of documentation to unblock your code, working through PDFs so big, every browser I tried failed to load them.\n\nDon’t take trains. As of writing, this term’s victims have only just started the train controller. We’ll have to implement real-time train position tracking and estimation, multi-train convoys, and routing across several trains, all while avoiding inter-train collision. Did I mention the train sensors don’t tell you where the trains are? \n\nDon’t take trains. If each of these was its own course, good luck. Together in one course? _Fucked_. Consider that if your train control code breaks spontaneously, the potential problem surface is massive. Maybe your code is wrong, or _maybe_, the memory locations storing your code are being overwritten. Maybe you’ve mistyped a single line of your context switching code, and somehow it worked well enough to slip through the past assignment successfully, only to spontaneously break later. Both of these are _real problems_ encountered in the past week.\n\nDon’t take trains. You don’t have the time. Assignment zero alone takes eighty hours minimum. You’re given one week. Every hour not spent in the lab is another hour up before the deadline, burning midnight oil in MC’s depths. \n\nDon’t take trains.\n\nDon’t take trains, because in that first week, you and thirty others will be in the lab until 2 AM every night, battling the Märklin train set in hopes to be set free. Huddled around the small wooden tables, you slowly get to know people. Each time someone finishes their project, quiet cheers resound. A0 is individually completed, but the whole room is your team.\n\nDon’t take trains. The late nights don’t stop. Weekends, reading week, they’re all passed in MC 3030. You join MC’s late night crew. You and CSC play a game of who goes to bed last. They almost always win. Each night, you’re alone on the sidewalks, so each night, you walk home playing music into the open air. \n\nDon’t take trains. Assignment 4 has you implement interrupt-driven I/O alongside a complete reimplementation of the eighty-hour Assignment 0, all in approximately one week. You work every day since returning halfway through reading week, and the night before the deadline, you’re still there. It’s 10:30 PM, the deadline is 9 AM, and eighteen of thirty classmates are in MC 3030. And we’re thriving.\n\nDon’t take trains. At 10 PM, your classmate is using his valuable time to debug others’ code. At midnight, you get Flock Stop’s strongest tea, a companion in the moonlight. At 12:30 AM, you have to solve only one more bug. At 1:00 AM, a friend leaves to work _anywhere_ but the lab. At 3:00 AM, he bursts through the door to announce _I WANT TO DIE_. At 3:30 AM, you still only have to solve one more bug. It’s the seventh new bug. By 4:30 AM, only four people have left the lab for the night. Fourteen of thirty remain. The entire lab is increasingly styled in mid-hackathon dishevelment chic. You leave at 4:30 AM to get three hours of sleep before an 8:30 AM presentation. You return the next morning; at least ten people have pulled all-nighters. They have to present to the class at 10 AM.\n\nDon’t take trains. At 11 AM, _befuddlED_ asks me: _Do you think you’ll regret this?_\n\n❦\n\nThe next night, on three hours of sleep, you take a bus—not a train—to London, Ontario. You check into a really sketchy AirBnB. And you run, shrouded in the midnight blanket, breathing winter air, to the downtown core. The Renaissance towers shine overhead, and the Thames runs below. You’re home.\n\nYou cross into London’s arena. Black eyeliner, spikes, leather, and frog hats fill the hallways and seats within. Three artists play. Winnetka Bowling League and Cavetown set the stage, with slow dances and sweet teeth.\n\nThen Mother Mother, the main act, emerges. With black and red, electric guitars, laser lights, and artificial fog, Hell takes the crowd, and the cacaphony screams:\n\n_GODDAMN, I LOVE TOO HARD, I LOVE TOO HOT, MY LOVE’S A FIRE_\n\n_EVERYTHING I CLAIM TO LOVE’S GOING UP IN FLAMES AND I BURN ALIVE_\n\n_I GOTTA LAY BACK IN A STRAIGHT JACKET AFTER SEX AND STILL INSPIRED_\n\n_AND MY FRIENDS WILL ASK WHEN I FEEL RELAXED AND I SAY_\n\n_WHEN I DIE (WHEN I DIE),_\n\n_I’LL LET GO (I’LL LET GO)_\n\n_BUT IN MY LIFE (IN MY LIFE),_\n\n_**I’LL HOLD ON UNTIL THERE’S NOTHING LEFT TO HOLD**_\n\nThe walk back feels brighter.\n\n❦\n\n_Glec_ always said “don’t take trains.” He then followed up on that. “If you hear my warning, and decide to take trains anyways, then you should take trains.”\n\nDon’t take trains. It’s Hell. But, maybe you’re Hell too. Maybe, just maybe, you have the determination to do it. Maybe, you’re willing to reject every warning. Maybe, you’re willing to run along the tracks at the oncoming train, daring it not to move.\n\nThis is the best course I have ever taken.\n\nDon’t take trains.\n","In Winter 2025, I was a student in the University of Waterloo's notorious CS 452: Real-time programming. The course asks you to do two small things:\n\n1. Write your own real-time kernel, given almost no starting code beyond a successful boot sequence.\n2. Use your real-time kernel to develop a control system for a model train set.\n\nThis had to be done in no more than three months, in teams of only two.\n\n![A nighttime photo of a street sign reading \"no exit\"`](/works/coding/cs452/no-exit.jpg)\n[caption](Taken on the walk home after a long night in the trains lab)\n\n\n## Real-time kernel\n\nThe kernel, arguably the easier ask of the course, is a multi-process kernel relying on message passing for inter-process communication. It interfaces with two I/O lines: one to the console, the other to the Märklin model train set; handling input in a timely manner required that the kernel also handle interrupts. \n\nA full feature list:\n\n### Context switching\n\nThe kernel is able to run multiple processes in single-threaded parallel; that is, each system call pre-empts the process, allowing a new process to continue execution. Implementing this required writing assembly code to save registers as required by the Application Binary Interface (ABI) to the process stack, then loading the new task's registers before handing control back to the next process.\n\n### Message passing\n\nThrough the implementation of system calls `Send()`, `Receive()`, and `Reply()`, we facilitated communication between processes. Sender processes could specify a target process to which to send an arbitrary bit string. When the receiving process called `Receive()`, it would be returned an incoming bit string, as well as the pid of the sender process. Finally, it could reply with another bit string, allowing for status indicators, API responses, and other valuable data.\n\nArbitrary bitstrings are challenging to identify the contents of. To handle this, we defined a pattern where the first 8 bits of any message were a code from 0-255, corresponding to a particular message type. Having identified the message type, the receiver process  could cast the bit string to that message type's request structure. We ultimately abstracted this away, allowing new processes to set up typesafe request parsing and handling with minimal opportunities to introduce new bugs.\n\n![An image of the track server code, containing repeated calls to `server_register_branch`](/works/coding/cs452/server.png)\n[caption](The main process for the track process: each possible subroutine is mapped to a message type, a message length, and a handler function)\n\n### Interrupts\n\nWe handled two types of interrupts: clock tick interrupts and input interrupts. This required similar systems to the context switching logic; only with more registers saved, and more processor configuration to properly spawn the interrupts. \n\nBecause of the speed of the processor relative to the lightweight nature of the tasks required of the operating system, the train control system could consistently run with a 90%+ idle time. What we discovered a month after writing the interrupt handling code is that this led almost every interrupt-driven context switch to occur while the processor was idle. No register state had to be restored, because it wasn't being used anyways.\n\nThis led to a particularly awful non-deterministic bug. Spontaneously, the program would crash, with no visible consistent cause. Trying to identify some root issue, we implemented a system of stack tracing - a functionality not natively found in our freestanding environment - where we made system calls throughout the program that would track the currently-executing function. \n\nEventually, we found the bug: each time the interrupt handler fired while the processor was non-idle, we crashed.\n\n![A crash log, where `AwaitEvent()` is the last process to execute pre-crash](/works/coding/cs452/interrupt-bug.jpg)\n[caption](Discovered at around 3 AM, the night before a 9 AM deadline. We did not sleep that night.)\n\nValuable lessons were learned about testing your code.\n\n### I/O\n\nHandling input was a non-trivial task to begin with. Ingesting the various RX, TX, RT, and CTS interrupts already takes some 600 lines of code to implement, without any complications.\n\nOf course, CS 452 can't be that simple, so there's another problem. The serial line connecting the Raspberry Pi's UART to the Märklin model train set is slow. Very slow. Because of this, sending commands to the Märklin involved a significant amount of custom handling. Consider that when the Pi sends a command to the Märklin, the Märklin must then lower its Clear To Send (CTS) signal to prevent the Pi from sending any more commands while it handles the current one. On a reasonably-fast serial line, this presents no issue. _However_, if the line is as slow as the one connecting to the Märklin sets, the lowered CTS signal can take so long to reach the Pi that the Pi sends another command to the Märklin during that time, which the Märklin summarily drops on the floor.\n\nIn effect, the CTS signal lies.\n\nTake CS 452, and you, too, can understand why all of the memes plastered to the window of the trains lab are about the CTS signal.\n\n## Train control\n\nWith the real-time kernel implemented, we then had to use it. The task was, at a very high level, simple: have multiple model trains navigate around the model train set without crashing into each other. \n\nSome problems:\n* The only way to determine a train's location is by reading that it has passed over a sensor. All sensor reads are subject to variable amounts of time delay.\n* When multiple trains are on the track, there is no reliable way to attribute a sensor to a given train. \n* To reliably be able to make decisions around train routing, and in particular, when to stop, you need accurate estimates of the train's location. This required knowing the train's m/s speed at each configurable train speed level, which existed on a non-linear scale of settings 0-14. The real-world m/s speed changed day-by-day based on accumulated grease, dust, and damage to the track.\n* Trains break. Tracks break. Often, the blocker to development was that someone else had the train you had measurements for.\n* Between 30 students, there were two tracks and five trains.\n\nTo top it all off, on the last night of the course, one of the trains, inexplicably, somehow, jumped off the tracks and table and smashed onto the floor.\n\nTwo leading schools of thought emerged among the students of the course: monolithic train control and multi-process train control. We opted for multi-process, where we split all functionality among many small processes. In the end, our total process count was over 70. In large part, this was caused by our decision to avoid almost all inter-process deadlock scenarios by simply making every process a server; that is, no meaningful process could ever be blocked on the execution of another process. To facilitate this, each server process spawned an associated courier task, which passed messages between the various servers.\n\n## Conclusions\n\n[This course was hell](https://mathnews.uwaterloo.ca/wp-content/uploads/2025/03/mathNEWS-157-5.pdf#page=8). It was also some of the best type 2 fun I've had in a while. It's like a mountain; there's very little fun about climbing it, but once you look back on it, you're proud of yourself for doing it.\n\nIt's also a trap. Entirely. This course is a trap for students who feel the need to climb the highest mountains. Every reasonable computer science student at UW will warn you not to take CS 452, and if you take it anyway, it's because you need to learn a valuable lesson about mountain climbing: sometimes, you don't need to do it.\n\nAt the beginning of the course, I reprioritized around this course, to attempt to do as best as I could at all possible times, sacrificing farmer's market trips, fun excursions, movie nights, and more, to the unquenchable beast that is the Märklin model train set.\n\nBy around the halfway point, however, I realized the true lesson it's trying to teach: _don't do that_. This is how, after the final kernel deadline, on three hours of sleep over the past thirty-six hours, I found myself in a dark, fog-filled, laser-lit London, Ontario arena, shouting at the top of my lungs, sharing with thousands of others a nearly-religious experience.\n\n![A crash log, where `AwaitEvent()` is the last process to execute pre-crash](/works/coding/cs452/mother-mother.jpg)\n\nLive to the fullest.\n","Almost a year ago now, I got to be the face of mathNEWS on live TV. I didn’t really expect to be on TV; I met a reporter for an interview near the erroring vending machine, but only when he pulled out the camera did I realize I was about to be git commit into the next broadcast. When they begin your interview for TV, they start with a lowball question. A kindergarten question. Yet for some in periods of change, a rather hard one.\n\n_Please say your name, then spell it._\n\n❦\n\n\\(t=0\\). Thursday evening. East Campus Hall. Game Dev Club. _Not a N*rd_ was giving an elaborate presentation on the topic of Undertale. I tried my best to focus, but on my laptop screen, I had the mathNEWS Discord server open, where we were, just a little bit, losing our minds. At 5 PM, _Dick Smithers_ began sending us pictures of the CTV nightly broadcast. CTV opened with a preview of the night’s stories; my interview there for all to see. Below it, the full name I gave.\n\n\\(t=1\\). CTV posted the news segment online. We watched; a mathNEWS screenshot has been broadcasted to thousands of televisions throughout the region. Editors past and present gathered in the general chat, _labyrinth_ messaged “YOURE FAMOUS,” and I could see that for a moment, in a tiny corner of the world, it might be briefly true. It saw its jet engine streaking across the sky, while I waited on the ground for the subsequent roar to overcome my ears in three, two…\n\n_Notification from Messenger. Parents Chat. Mom._\n\n\\(t=2\\). _Not a N*rd_’s Undertale presentation concluded, and the roar had silenced. It was gone. Over a year of uncertainty, resolved in East Campus 5. We went to Mel’s after, and almost no one there knew. No one said anything. Only walking home later with tomatopotato did we coincidentally pass _god⚡peED_, who called from afar that he’s heard I’m “famous now.” It’s the first time the ramifications becomes real.\n\n❦\n\n\\(t=17\\). Friday morning. The impact is still limited; sure, family members in KW saw the segment, but it hadn’t escaped KW. It’s fine. We’re fine.\n\n\\(t=20\\). mathNEWS hits The Guardian.\n\n\\(t=25\\). The story circulated. One-by-one, publications repeated the story. One-by-one, my five letters bounced around the world. I’d kicked a rock off the mountaintop, and every passing hour, more snow joined the avalanche. \n\nMy partner at the time and I met in Toronto after work, and journeyed through the city of light. The weathered signs of Chinatown passed us by, one thousand colours in one thousand shadows. Neon signs hang above, shopfronts cram for space. We dodge into a restaurant, and talk about the unveiled secret; yet for twenty minutes of conversation, they didn’t realize what secret had been unveiled. They didn’t realize this was how my world found out.\n\nIn a Chinatown restaurant, someone for the first time fully understood. We left the restaurant into streets of slush, together listening to the timebomb’s ticks.\n\n\\(t=26\\). We reached the Art Gallery of Ontario, its warm wooden walls like the familiar kitchen after a long journey home. People milled about, gentle music called from an evening concert deeper within. It was serenity. Comfort. For just a few hours, home. \n\nJust as peace was resettling, it happened again.\n\n_Notification from Messenger. Extended Family Group Chat. Grandma._\n\nIn that oaken front foyer, possibilities collapsed.\n\n❦\n\n_Please say your name, then spell it._\n\nIt’s a kindergarten question. And yet, for too many years, a hard one. Was it the _they_ thing? More and more, I wonder if it was simple desire to set myself apart. To be a child no longer. To definitively say that from this point onwards, I am only my own. No gods. No masters. Only me.\n\nA while ago, I changed my answer.\n\nmathNEWS was one of the first places I did. It was among the first true places. MathSoc was another. I made myself a promise then: in every new space, I would go forward with my new answer. Slowly, I changed my world, and slowly, I’ve become stronger for it.\n\n_Please say your name, then spell it._ I knew it would reach home. I knew my uncle’s mother-in-law would be watching the CTV broadcast, I knew she would call him over, and he would contact my parents, and the ruse would be up. But that promise, that golden promise. It could not be broken.\n\nFive letters. Each one, cannonfire, ringing out a nail in a coffin of the alternative. \n\n❦\n\nI visited friends the next night, almost all of them mathNEWS writers past and present. They all had followed the story, but no one knew that I’d done it under what was, to my family, a new name. When I told people that part later, most would ask “are you okay?” “how are you doing?” “holy _shit_, are you okay??” \n\nBut I’d seen the messages.\n\n> _Your uncle let us know you were on the news and we found the article! Good for you 🙂. You did it!_\n\n> _Saw your news clip on the news just now. Well done. Love._\n\nThe secret to best all secrets, and in the end, it really wasn’t much of anything.\n\nThat night? I came back to Waterloo, and the world had changed. There were worlds in which it had changed for the worst. But this one?\n\nIn this one the die had been cast, and we came out on the other side, bursting to the seams not with loss, but incredulous laughter.\n\nThank you, mathNEWS, for helping me to keep the promise.\n","This is a game hastily thrown together in approximately four hours for the University of Waterloo's Winter 2025 Game Jam - theme: \"cool down\". \n\nIn this game, two teams of players, taking turns at the same keyboard, must enter the names of a series of countries while racing against an ever-decreasing timer. Each time a team successfully enters a name, they will have a bit of extra time added to their countdown clock. The scoring algorithm is a tightly-guarded secret, but here's a hint: it has something to do with \"cool\" and \"down.\"\n\nThis is not a guessing game. \n\nThis is a list-all-the-countries-you-know-as-fast-as-possible game.\n\nThe first team to run out of time on their countdown clock loses.\n","Ten years ago, London, Ontario developer Digital Extremes released a new character for their studio-defining sci-fi title, Warframe: Equinox, a quiet, composed ninja robot[1] defined by balance. Choral music followed her footsteps, as players paired her with kunai, shurikens, and finely-crafted bows to defeat hordes of gruesome far-future opponents.\n\nReturn to the game now, and you’ll be greeted by Digital Extremes’ newest update: Warframe: 1999. In it, you’re suddenly playing a half-human half-warframe hybrid, screaming down European streets on a diesel-chugging motorcycle with an AK-47 strapped to your back, navigating a world transformed by Y2K-turned-tech-zombie-apocalypse. The choir has been shot, their music replaced by Nine Inch Nails; the aliens have vanished, replaced by zombified CRT television sets; balance is moot, and violence is now.\n\nOutside observers might say the game has lost its way.\n\nThey’re incredibly right. It’s a good thing.\n\nBeware spoilers.\n\n## THE LITH ERA: SILENT HARMONIES \n\nBefore 1999, Warframe was strictly set in the distant future. Taking place throughout our solar system, the player controls an assortment of superpowered ninja-like robots—known as warframes—battling against twin capitalist and communist galactic empires, at speeds of hundreds of slain enemies a minute. Quests were simple: go here, kill things, defeat captains. Themes? Stories? What are you talking about? Go impale bad guys.\n\nBack before the past ten years of content updates, high-level Warframe gameplay was defined by Void Farming. Your team would repeatedly run the hardest mission available: an endless survival against the backdrop of an ancient empire’s ivory-and-gold palaces. Wisps of white energy trailed up from the gilded floors, ninja-like players shot silent arrows into alien foes, and choral music haunted the halls.\n\nY2K, at the time, did not.\n\n![image](/works/writing/mathnews/warframe-1.png)\n\n## THE MESO ERA: VOICES AND CHARACTER\n\nYou can only run endless missions in white-walled palaces for so long. Warframe had to grow. Digital Extremes had started hosting yearly Warframe conventions in London, Ontario – each year, gaming influencers from the world over descended on London for one weekend[2]. Each year, Digital Extremes needed massive, flashy new content to showcase to justify the trip. After all, it’s London.\n\nJustifications came. The robots gained personality: the lineup of glossy space ninjas was augmented by a monkey king, a fairy queen, a sea captain, and a synthwave DJ. Why kill enemies with a sword? Now, you can use Darude: Sandstorm to bleed their ears to death.[3] \n\nFlashier content came. Warframe added open worlds, from Earthen plains. to Venusian iceflats[4], to the zombified husk of a Martian moon. New music followed. With the release of the Venusian iceflats, Digital Extremes ventured into English-language songs, releasing We All Lift Together, a chain-gang anthem of indentured cybernetic slaves dreaming of freedom. I still sing it when walking home in the snow.\n\nGone were the days of silent androids and ivory halls. Character had come to rule.\n\n![image](/works/writing/mathnews/warframe-2.png)\n\n## THE NEO ERA: FIRST GLIMPSES OF TAU\n\nDigital Extremes was not yet satisfied. Rather than continue to add reasonable expansions, more open worlds, more galactic conflict, they began to swing for the fences. \n\nIn 2021, Digital Extremes released their long-awaited expansion The New War, closing off the past ten years of storytelling and leaving a clean slate. Where did the high-octane, sci-fi robot looter-shooter go next?\n\nThey released a souls-like gamemode[5] featuring a pegasus-riding samurai.\n\nInstead of the mach-speed flamethrower-wielding robots players were familiar with, players now had to maneuver the careful sword strikes of a vulnerable, lone human. Familiar gameplay? Who needs it? Through the new dreamscape setting, Digital Extremes told a new story. Was it of galactic struggle? Of space warriors shooting their path to victory?\n\nIt was a story of breaking the cycle of depression.\n\nThey kept going. Eight months later, Digital Extremes released a new quest, pitting the space ninja robots against an eldritch god. In its last moments, the players take control of a titanic statue, steeling themselves for a Pacific Rim humans-vs-Kaiju battle. How does the statue fare against the raging eldritch god?\n\nIt takes the god’s face into its hands, and reads it a love letter.\n\n![image](/works/writing/mathnews/warframe-3.png)\n\nDigital Extremes would not relent. As players prepared for Warframe: 1999, they released one last questline, where the player character tracks down and cares for someone suffering from a mystery ailment. Near its end, you play a osu!-like rhythm minigame to assist the character in their pain. Only when the character dies, and a newborn is taken from their deathbed, do you realize the minigame’s nature.\n\nContractions. They made a dying mother’s contractions into a rhythm game.\n\n## THE AXI ERA: NINE INCH NAILS MEETS THE POWER OF LOVE   \n\nIn December 2024, Digital Extremes released Warframe: 1999. Contents include a new set of playable maps set in the cityscapes of Earth, 1999. The Warframes have cast aside their bows and moth wings, now sporting AK-47s atop diesel-fueled motorcycles. Begone galactic soldiers; techrot zombies with CRT televisions for heads rush the player en masse. Away with the choir; missions are set to the electric edge of metal ambience and Nine Inch Nails. In the expansion’s first hours, players time travel, attempt to save the world, and fail horribly. From that point on, players’ key quest is to have daily conversations with each of the six new NPCs to befriend and even enamour them, in Warframe’s, a looter shooter’s, most widely-beloved piece of new content yet: \n\nA dating sim.\n\nShowcasing the Warframe of today to twelve-year-old me, logging into the game for the first few times, would be akin to giving a ghost pepper to a Victorian child. It is so dramatically different. Yet, it is also the same. Despite the difference in visuals, the core gameplay, plot, and theme remains.\n\nWhat is a space ninja? Perhaps it is not only a stealthy warrior in the depths of space. Perhaps a ninja is simply someone willing to take unconventional approaches. To reach for nearby galaxies when this one would do fine. In this way, Warframe is Digital Extremes’ self-insert. Consistently, they take the most unconventional options, and consistently, they blow us away.\n\nSeriously. Dying contractions. Rhythm game. Who does that?\n\n--postscript--\n\n1. Technically they’re almost entirely organic material transformed by the Helminth strain of the infestation, and thereby not at all robots, but that’s way too much lore for this article.\n2. Somewhere on YouTube, there’s a video of Digital Extremes’ community team being interviewed while driving. In the beginning, you can see the grocery store Remark in the car’s back window. I still find that cool.\n3. The synthwave DJ’s abilities all center around your ability to play custom music to the enemies, doing damage thereby. More beats means more damage. Playing Darude: Sandstorm on repeat is, in my opinion, the single strongest path through the midgame.\n4. When I say “far future,” I mean really far future. Far future enough that after an empire was able to rise up, figure out planetary terraforming, and subsequently collapse for unrelated reasons, the empire’s remnants later fucked up the big thermostat and managed to freeze Venus. \n5. Souls-like in style, if not in difficulty.\n","i saved five dollars on a presto ticket the other day\n\n> by walking from square one to union\n\nsee it’s a really quite easy fifty (thousand) steps\n\n> just walk southeast from square one to dixie/queensway\n\n> > east on the queensway to sherway gardens\n\n> > southeast to the lake\n\n> > and east to the station\n\n> > its so easy that you don’t need a map\n\njust a good sense of direction\n\ntwo feet\n\nand time\n\n[linebreak]\n\nwalking all that distance, no map, no music\n\n> one might expect to find\n\n> > some grand revelation\n\n> > a great internal debate\n\n> > a wellspring of emotion\n\n> > anything really\n\n> but journeying through yards industrial\n\n> offices dismal\n\n> and the suburbs of famous mississauga suburban road:\n\n> > bloor street\n\n> i was somehow surprised by mississauga\n\n> > not really having much\n\n[linebreak]\n\nsometimes life doesn’t have much;\n\nin terror at the void we perceive, we fill it\n\n> with fears and despair;\n\n> hymnals and prayers\n\nwe cannot fathom directionlessness\n\ninstead\n\n> through god or antidepressants\n\n> we cope\n\n[linebreak]\n\ni do not know how to pray.\n\nbut i know how to set one foot ahead of the other\n\ni know how to breathe in the air\n\ni never know how i will get home\n\n> from an industrial yard i’ve never seen before\n\ni do not know for certain what direction i am travelling\n\ni do not know how far away i am\n\n> how long it will take\n\n> who will be on the way\n\nupon the toronto sidewalk i really don’t know much\n\n> of anything\n\ni do not know how to pray.\n\nbut i know my legs will take me down roads\n\ni will not see the course of\n\n> until at the unfathomable journey’s end, i open my google map\n\n> and fathom it\n\n[linebreak]\n\ni do not know how to pray\n\nbut on the south side of the queensway there’s an asphalt path\n\nstretching along green hills, fading\n\n> into the cloudy horizon, and at its end\n\n> towers from etobicoke peek into the stars\n\ntrucks scream into the concrete void\n\n> beside them walked me,\n\n> armed with mittens\n\n> > a coat\n\n> > and a peanut butter granola bar\n\nthere is nothing in mississauga\n\n> but a peanut butter granola bar:\n\n> > whole oats, sugars, peanuts, salt\n\n> > high monounsaturated sunflower oil,\n\n> > trust.\n","I have my full portfolio of JavaScript projects, dating back to 2017, uploaded at [https://some-molasses.github.io/](https://some-molasses.github.io/). \n\nIdeally, this would all be uploaded to the website you're currently on. Unfortunately, I have yet to have the time. The school semester - in particular, CS 452: Real-time Programming, has taken substantially more time than I expected it would. I'll continue to migrate projects over to this site as time allows.\n","While working on Faire's search infrastructure team in early 2024, I realized that despite the breadth of topics I had been exposed to as part of my University of Waterloo education, search systems had been entirely missed. Luckily, one of my fellow co-op students had recently taken a course MSE 541: Search Engines that he could not recommend highly enough.\n\nIn Fall 2024, I took his advice and enrolled in MSE 541. In the course, students are taught how to construct the fundamentals of a text retrieval engine. To demonstrate our understanding, we were given a full dataset of every LATimes article published in the years 1989 and 1990, and told to build a search engine based on it.\n\n## Components\n\n### Indexing\n\nIndexing a 131 000-document collection was fun. I was lucky enough to be able to construct the inverted index and lexicon on RAM*, although through the course I was also introduced to alternative mechanisms for larger datasets. Each document, upon being unzipped, had to be tokenized, with any new tokens saved to a lexicon of all words in the collection. Key attributes, like article titles and document lengths, were extracted and written into metadata files. Most importantly, the token frequencies were then counted and added to an inverted index; a data structure that compresses a `n_words` x `n_documents` matrix of term frequencies per document.\n\n*At least, I was able to do so on a modern thinkpad. My poor 2017 PC had a bit more difficulty :(\n\nTo help to conflate like terms, I implemented stemming as a part of this process, using the Porter stemmer. This allowed for terms like \"run,\" \"ran,\" \"running,\" \"runner,\" etc., to all be mapped to the same token. This significantly helps to improve the engine's recall of results, at a small penalty to its precision.\n\n### Ranking methods\n\nI implemented several methods of retrieving documents from the collection. First was Boolean AND retrieval; a simple retrieval method identifying each from the user's query and returning all documents containing all words from the query. This is a famously bad mechanism, but it served as a good measurement baseline to compare against later.\n\nI then advanced to more complex mechanisms. Using a generic `Query` object, I was able to swap out different types of query based on the context of the program I was executing - or in particular, what I was hoping to measure at the time. I implemented two more retrieval methods: cosine similarity and BM25 retrieval. Cosine similarity retrieval took the dot product of the term frequency and inverse document frequency of each term in the query and document vectors, then used that value as the score by which to rank documents. BM25 retrieval did a similar thing, but with a distinctly more complex computation powering it.\n\nUltimately, both boiled down to a neat core idea that the relevance of a document to a user is a function that increases with the number of times query terms appear in the document, and decrease with the number of times the term appears in all documents. A word like 'osteoporosis' appearing multiple times could contribute a substantial amount to a document this way, while a word like 'the' appearing multiple times has almost no effect.\n\n### Query-biased summaries and the retrieval interface\n\nThe last key part of the project involved constructing a user interface by which people could search the 131 000 documents. For simplicity, I only ever displayed the top 10 results.\n\n![](/works/coding/mse541/summaries.png)\n\nNotice how each of the document summaries has been custom-constructed to suit my query term \"molasses.\" This is the implementation of query-biased summaries. When generating the search engine results page, for each item, I split up all of the sentences into mini-documents, then perform mini-retrieval on them, scoring them based on their relevance to the query. From this, I can then construct a description that highlights the most relevant parts of the document, giving the user a sense of the document's topic without having to actually access it.\n\n### Evaluation mechanisms\n\nOne last thing I implemented was retrieval metrics. Using a dataset of TREC evalutors' relevance decisions on the set of LATimes articles with respect to a predefined list of queries, I was able to calculate metrics including average precision, precision@n, and NDCG@n. I could then measure the varying retrieval methods to one another, seeing in what areas each one excelled.\n\n## Future work\n\nNow that the associated course is done, I don't intend to work on this particular engine much further. However, I've taken many of the principles and software patterns within it, and applied them to the website you are currently reading. Using the search functionality, you may find a very familiar highlighting logic as displayed above. \n\nI'd like to soon implement more interesting features to ingest into the ranking algorithm: tags, query history and interaction history, and more. Unfortunately, I am still _searching_ for time :)\n","The wildlife had left.\n\nFew of the local housecats remember their time. Long ago, the valley was full of wild creatures. The raccoons, the turtles, the heron, and most importantly, the rabbit. None remain. None are remembered, etched into legends told at the housecats’ secret midnight meets.\n\nNone but the rabbit. \n\nWhen the humans came to the valley, the housecats say the raccoons were the first to try to leave. The rabbit, however, had other plans. The raccoons saw job opportunities far away, it’s said; far away, garbage collectors were in high demand. Garbage collectors? What an absurd reason to leave. \n\nThe rabbit would show they could collect garbage at home. \n\nWhen the humans came to transform the valley, cutting down trees and uprooting the forest floor, the rabbit stowed away their scraps. As they brought in their machines, the rabbit mapped out all their favourite dumping sites. When the humans installed trash cans, the rabbit journeyed into the pre-dawn fog, throwing his little weight against the black cans until they spilled their rotten contents onto the muddy ground. When the valley had been cleared, and only upturned dirt remained, the rabbit again found the raccoons. “Look!”, said the rabbit, presenting his maps. “There is such garbage here! I have drawn you maps, I have spread more for you to find! You need not go away, everything you need is here!” \n\nBut the raccoons were already leaving. They expressed their appreciation, they invited him to visit, but no effort he made could get them to stay. \n\nIt was not the same.\n\nHe did not think about it long. Later that very day, he encountered the turtles with all their belongings stacked upon their shells. “Leaving now?” the rabbit exclaimed. “What about our Winter fair? What about our summer concerts? You can’t leave, you’ll never see them again!”\n\nBut the turtles dreamt of the sea. There was no sea in the valley.\n\nNot yet. The rabbit bounded to the human cabins. Days he stalked them; while the humans constructed the housecats’ homes, he learned their patterns, their vision, their habits, until one day, he snuck into their office. He took a pen between his teeth. On all the humans’ blueprints of the valley, he drew a great blue pond.\n\nWooden frames rose. New trees sprouted from the earth. Oil and steel roared along their gravel roads. Soon enough, the humans dug a hole. Within the week, a great pond nine hundred rabbit lengths across took shape within the valley. \n\nIt was not enough. Their shells piled high, the turtles walked into the world beyond. The valley had water, but for all the rabbit’s efforts to persuade the turtles otherwise, it was no sea. \n\nIt was not the same.\n\nThe raccoons had garbage, the turtles had water, but no one would stay. Human children ruled the valley now; their lights cast away the darkness each night. Soon, only the rabbit and a lone heron remained. One day, the heron told the rabbit he was leaving too. \n\nIn all the construction, the heron’s pond had been lost. But the rabbit could find it. As the humans took their yellow machines away, and the last homes replaced mud and clay for grass and trees, again the rabbit stole into the construction office. With his tiny paws, he opened their steel drawers, searching through map after map. He found one. \n\nThat night, the rabbit and the heron journeyed. The last two creatures walked the paved streets, crossing between streetlight beams and mowed lawns. Arriving at a house, the rabbit dug his paws into the earth, carving a tunnel under their backyard fence. Within the home’s backyard, untouched, as it always was, they found the heron’s pond.\n\nThe heron stood in the waters. He stuck his beak under the surface. He splashed with his wings. He looked at the rabbit, and turned his head. \n\n“Is this the same pond?”\n\nThe rabbit was confused. Of course it’s the same pond, he had checked. Didn’t the heron recognize it? The rabbit double checked, he stood beside the heron and looked into the evening water; in its reflection, a rabbit and a heron looked back out at him. \n\n“It has to be the same,” the rabbit said. \n\nHe looked at the heron, confused.\n\n“Perhaps, dear rabbit. It may be the same water.”\n\nFor a moment, he stood there.\n\n“But it is not the same time.”\n\nThe heron flew away.\n\n❦\n\nThe rabbit stayed in the old valley a while longer. He continued his same morning forages. He still passed by the raccoons’ old warrens, now barren. He passed by the turtles’ old bushes, now a fire hydrant. He passed by the heron’s old pond, now locked away. New creatures came, but they were different. Younger. Brighter. He never got to know them. Winter came, and with it, frost. While the new housecats of the valley could convince the humans to let them into their warm homes, the rabbit never seemed able to.\n\nAsk any of the housecats of the valley, and they’ll tell you about him. The last rabbit. They won’t bring you to him. The younger ones say he was run over by a truck.\n\nBut ask the oldest housecat, who lives in the house on the hill, and he’ll tell you a different story. He’ll tell you that one night, in a pure whiteout, the rabbit must have gotten lost, for the housecat saw him bounding by in the early morning light. By pure accident, in the blinding snow, he had made it atop the valley’s eastern hillside. He had made it out.\n\nFrom atop that hill, he had would have seen not only his own valley, but countless more. Rich with life, some human, some wild. From above, they would have all looked look the same. Even his own. Did he have to stay? No path down led to the valley of his youth. \n\nOnly to the valley of that day.\n\nThe housecats never saw him again.\n","### Ingredients\n\n- some \\\\(n\\\\) tomatoes\n- 1 chopped onion\n- garlic, chopped\n- spices?\n- several hot peppers, chopped (e.g. jalapeños, chili peppers, whatever you can find really)\n- an entire handful of cold herbs, chopped (e.g. basil, parsley, cilantro, mint)\n- whatever else u want \\<3\n\n### Instructions\n\n1. in a large pot, add chopped onion, garlic, and spices. Stir and let cook for the next few minutes.\n2. add tomatoes, hot peppers, and leaves\n3. let cook for approximately 20 minutes, or whenever the tomatoes have sufficiently broken down\n4. serve with kleenex\n\nit’s called sinusoidal soup because it makes your sinuses go “oi” immediately before experiencing the entire range of heat to cold at once. It’s a bit like\n\n\\\\\\[  \n\\\\text{very hot} \\+ \\\\text{very cold} \\= \\\\text{very hot} \\+ \\\\text{very $\\\\neg$hot} \\= \\\\text{very}  \n\\\\\\]\n\nstrongly recommended if you ever feel like clearing out your entire head.\n","On Erb St W, halfway between University Ave and Fischer-Hallman, there’s an unremarkable one-story plaza you’ve probably passed before. Made of black siding above red bricks, it contains simple essentials: a variety store, a hair salon, an insurance agent, and more. It also contains two shops, signs of bright orange above their door: Noor Food Market, and Noor Food Market (again). \n\nThey’re the best Noor Food Markets this city has ever seen.\n\n## AN IMPERFECT GROCERY STORE\n\nThere’s a lot that’s bizarre about Noor Food Market. For one, whose idea was it to make two of them? To get the full Noor Food Market experience, you have to enter one store, get your groceries, go through the checkout, then walk outside, down the sidewalk, just to enter the second Noor Food Market. Topping it off? Between Noor Food Market and Noor Food Market Two, there’s a random pharmacy third wheeling.\n\n![image](/works/writing/mathnews/noor.png)\n[caption](HOW DID HE GET THERE)\n\nThis pharmacy amuses me to no end. How did it end up between two Noor Food Markets? Who came first? Do they talk? Is it like being in a car’s middle seat? Is the pharmacist the middle child? I want answers.\n\nThere’s more inside. Given the small space, they only have one cash register. Last year, it was by the front window, creating a clear traffic flow around the perimeter of the store. \n\nSince then, they’ve reorganized the store to make it… worse? You walk in, and the end of the checkout is immediately in front of you, putting your footpath directly in conflict with those trying to pay. You pick up your basket from the lane’s end, but to get to the produce, you have to dance around people that were previously hidden away. \n\nAt least it feels cozy inside? That’s primarily because of the wood floors they have. Can you recall ever seeing wood floors in a grocery store? I’m reasonably certain it’s actually vinyl - still, who chooses the wood pattern for their grocery store? Loblaw would never. I can’t overstate the coziness though; the auditory experience doesn’t exist. They’ve outsmarted Mariah Carey by simply playing no music, ever. The sound of their door chime is etched into my mind; the whole time you’re in the store, you’re intensely aware of everyone around you, because amid the freezer array hum, you can hear everything they do. \n\nI love that.\n\n## NOOR FOOD, MARKETED \n\nNoor Food Market (the first)’s small scale limits how much they can sell, but they still have most of the essentials. They have only one small freezer in the back full of produce, but do you really need more? What more is there beyond tomatoes, apples, carrots, onions, potatoes, and garlic anyway? \n\nThe answer is dates. At least twenty-two varieties of them. I don’t think T&T even stocks dates, and all the other big chains only ever stock the one brand, on occasion, hidden in some dark corner. Not Noor Food Market. Every type of date you can dream of, they have in stock. They even stock a date bread—like a hybrid between a donut and a soft bagel, formed of chain-link sections with dates at their cores. It’s revolutionary. I once brought some on the one hundred twenty kilometer journey home just to give my mom and dad the chance to try it.\n\nThey stock bread too of course - not boring, price-fixed European bread, but varieties upon varieties of naan. At this point I’ve just stopped eating European bread—when the ancient Greeks theologians described the “nectar of the gods,” I imagine they were thinking about grilled cheese on naan loaves. \n\nAll this, and I’ve not mentioned the best part. It’s cheaper than Loblaw. By a lot. Comparing pictures I took of Noor Food Market pricing to the prices Zehrs, T&T, and Walmart list online, Noor Food Market was cheaper on average than all of them.[1]\n\n## THE SECRET TO CHEAPER FOOD\n\nThe last time I talked to a mathNEWS writer about my beloved local food market, they wouldn’t have any of it. They maintained that they would prefer to eat food that was, quote, “not mouldy.”\n\nAnd… fair. I guess. You’d have to be blind to think that Noor Food Market produce is of the same grade as chain store produce. Whereas Zehrs sells only the top of the line, Extra Fancy, plastic-shine apples, Noor’s are distinctly more banged-up. The onions are often ugly, and the tomatoes are sometimes softer than usual. My theory is that they stock the lower-grade produce Loblaw doesn’t go for - all the food that wasn’t good enough for rich suburbia.\n\nIn one line, that is what I love about Noor Food Market. We exist in this world of perfection. We joke about Cali or Bust, but it comes from the need to be the best. To be perfect. Every week, sometimes every day, one of us makes a r/uwaterloo post about not being able to meet their stratospheric expectations. We push our heads against the grindstone, we test our limits every term, because if you can’t run five clubs and play on three sports teams, what are you doing with your life? If you can’t make the top co-ops, are you wasting your chance? If you can’t do five courses a term, if you can’t ace every midterm, if you can’t maintain your GPA, what the fuck’s the point? \n\nThe point is to try. Not to be perfect. Not to reach some unattainable standard, neither to be flawless nor without challenge. Simply enough. A human, doing their best. Behind every flaw of Noor Food Market is a human that tried. Maybe they’re not doing perfectly, maybe they could use a bit more music, but the lack thereof shows that a human forgot. Not an algorithm, not a verticalized business process nor a committee. Just someone like us. \n\nIn the end, I don’t mind if the tomatoes are a bit mushy. It makes for better soup.\n\n--postscript--\n\n1. I found Zehrs, T&T, and Walmart to be 31.34%, 24.41%, and 22.30% more expensive per pound of produce on average. My data collection methods were probably super flawed though, so take those metrics with an entire soup ladle of salt.\n","Packed into a car, looking out over Columbia Lake, the black sky didn’t look that different. Streetlights dotted the landscape, trees stood out against the ambient glow; it was just that above, the clouds didn’t look right. Somehow, they were slightly too stretched. Almost smeared against the above, and slightly green. Travelers stopped at intersections, pointing phone cameras at the stars. Seekers foraged into the Laurel Creek Conservation Area, and at the city’s northern edge, students clustered at the final intersection to watch the skies.\n\nThe Sun had sent home.\n\n❦\n\nWe drove, thirty minutes through dark hills and quiet corners, passing countless cars parked at the roadside, stargazers staking their claim to the beyond. Many parked along major arteries, but we wanted better. We found our safe spot at the side road labeled “Warning: Drive At Own Risk.” With a cornfield to our left, a harvested open plain to our right, we rumbled along a gravelled path until we found our spot to stop. Behind us, a few farms held silent vigil in the shadows, their warehouses and farmhouses distant boxes against the treelines. All that broke the night’s silence was barking dogs on the October air.\n\n❦\n\nFrom our isolated side road, wispy cornstalks lined the base of our vision. Trees cast outlines against the distant void, and just above, the stars slept, forming a dark patch on the horizon save for the seven stars of the big dipper, framed in shadow, brilliant above the blowing corn.\n\nAbove, crowning the constellation, brushstrokes of faint lily and rose drew hues from the abyss beyond.\n\nEveryone I’ve asked about it went home after that.\n\n❦\n\nAs I watch the sky, I keep seeing pale flashes. I look around, searching for a spotlight, a concert, something that could highlight the clouds so briefly. Nothing. Thirty minutes pass, all the while, I’m trying to figure out when I last saw an optometrist.\n\n“Did you see that?” someone with me says. It happens again. And again. Flashes, patches of faintly brighter sky appear and disappear, each one present for only a second, before flying above our heads and beyond. To this day I don’t know what it was. A direct hit from the solar storm? A magnetic flare-up?\n\nIt doesn’t stop. With greater intensity, patches of faintly brighter light apparate across our vision, more large, more fast, more often. Each one spans massive swaths of the atmosphere – raise a hand before you as though to shield your eyes; each patch is about the area of sky hidden by your open palm. Some form in waves, traveling from the horizon to the zenith in world-encompassing curves, traveling hundreds of kilometers in a second, only to tangent away into distant space. Abyssal radiation glances off the planet at unfathomable speeds; magnetism shielding life below from the wails of the void beyond.\n\nFrom our silent cornfield, we watched the magnetic field fight Ragnarok alone.\n\nHow do you respond to that? What do you say when the Gods come home?\n\nWe asked my friend if he had applied to grad schools yet.\n\n--postscript--\n\nHe had not.\n","Picture a Hall. Not a hall, but a Hall. Capital H. In my imagining, it's one well-maintained deep room, with black-clothed tables set throughout. The walls are soft white, there's few windows, but there's pictures instead: each one a wintry landscape—in some, there's even a deer. In one corner of the Hall stands a well-stocked fridge; above, the ceiling tiles are rectangular with light panels poorly hiding fluorescent tubes. You can book it through the Hall's modern website. They accept credit cards.\n\nLet me tell you about the Hall in the land they call Gespe'g. \n\nWhen my family visited the Gaspé peninsula this year, we knew that before the Appalachians would set us free, we would have to visit the Hall. I’d never been, but in my father’s descriptions, it was legendary. The Hall, home of many a Gaspésian occasion. The Hall, backdrop of countless summer days. The Hall, the beating heart of the Atlantic coast. \n\nWhen the day comes, my family—mom, dad, uncle, and I—pack into a car and depart the beach town of Percé. With the ocean air cramming into our ears, we ascend a seventeen percent grade into the Appalachian mountains. Cresting a hill, we swerve, pass under a reddish rockwall one hundred metres high, climb another hill, dive into a valley of pines, and Percé, at last, sets us free.\n\nThrough level fields, we drive. Town after town pass us by, until we approach the town of the Hall. Yet, once there, all I find are empty shells, land where my grandfather’s general store once stood, and a gas station so old, it lacks self-serve. No legendary community heart. No Hall.\n\nWe drive still. Stores fade, replaced by lawns of unkempt wildgrass, old motels cozy and decaying, and isolated art galleries I’ll never fathom the viability of. With civilization fading behind us, we finally find the Hall. \n\nAt the town's furthest edge, a brilliant chapel spire rises from the Earth, with a silver-plated roof to capture shards of the distant sun. Time-weathered displays paint its pointed windows, and metal crosses bind its solid doors to their frame. Nothing mars the chapel yard, save for an old graveyard, and a forgotten wooden barn. \n\nThe barn’s only entrance is in the vertical middle of its two-storey wall. Amid sides of long-greyed wood, an uneven ramp of sun-baked planks reaches from the grass to meet it. Below, in its sealed lower level, shadows play among long-abandoned horse stables, withering in the dark. I was lucky we were here for the chapel Hall; we wouldn't be locked in with them.\n\nThe chapel was closed.\n\nIn the land they call Gespe’g, the Hall isn’t a building in the center of town. \n\nIt’s not even the chapel on the outside of town.\n\nIt’s the old barn behind it.\n\n❦\n\nWho walks with you? We had barely visited the Hall before our appointment came to leave it. Finally, we had to confront our reason for being there. My parents, my uncle, and I walk down the moss-encrusted ramp to the clearing path. At its end, the trees open to a grassy field, wherein stand a hundred vertical stones.\n\nWho walks with you? We arrive at the cemetery, and amid the cars at its side, Ontario license plates shine lakefront blue. Some forty people gather at the entrance, some returning home, some who’d never left. Forty people, all of whom either answered the call to travel eighteen hours for a fifteen minute ceremony, or who heard about the passing of a grandfather who hadn’t lived in the Gaspé for almost fifty years, and still elected to attend. \n\nWho walks with you? We enter the cemetery, and within, a car awaits. Family sits in the backseat, people who had once invited my family into their home, now too ill to stand. Time stuns; how dare it caress this untouched place? How can the hands be so weak, that welcomed me into their home just one visit ago? We pass by stones engraved with the names of loved ones I've known. Our congregation grows in number, memory walks between us.\n\nWho walks with you? We stop, and before us stands a knee-high gravestone. On its face, letters spell my family's shared name. Forty relatives gather, spirits fill the gaps among them, and my great-aunt holds my father and I closer than ever.\n\nWho walks with you?\n\nHome.\n\n![image](/works/writing/mathnews/gespeg-3.jpg)\n\n❦\n\nThe ceremony is over in barely fifteen minutes. In ten minutes more, someone has made my father laugh. My great-aunt has let me out of her arms, and my mother and I search the cemetery for odd gravestones and unfortunate names. Soon, all attendees have driven back to the Hall, leaving my uncle, mom, dad, and I, to walk. \n\nIn moments, we ascend the ramp into the Hall.\n\nPolished wooden floors stretch the length of its single room; at its end, sunlight streams through the window into a white kitchen, stocked by relatives with plates of sandwiches, fruits, and desserts. Above them, a painted sign celebrates the Hall's hundred year anniversary: nineteen eighty-five. Tables pack the room wall-to-wall, each with white plastic tablecloths spread atop. Each one seats my family: those I’ve never known, those that raised me, those I’ve only heard tales of, all clustered into this single room in the chapel barn. And all around, wood-panel walls rise in pale yellow, a particular shade my grandmother’s family has used for generations that to this day, we paint the spaces we care about the most. \n\nLong before the arrival of the Europeans, the Mi’kmaq people called this land Gespe’g. In their language, the word means End. In that Hall, I could believe it. Heaven, in my estimation, is this. An old, pale yellow room, hand-constructed, with simple furnishings and homemade foods. Those I love cluster around every table, and laughter fills the air. My family is with me, sunlight streams through the windows, and outside, mountains and waves roll across the distant horizons.\n","Beyond the Appalachian mountains, there’s a small fishing town called Percé. The roads to it are long and treacherous, and once you’re there, you're as trapped as the lobsters of old. The town leaves you only one thing to do.\n\nListen.\n\n## THE CALL OF THE GASPÉ\n\nIn an early morning of August 2016, the long pointed wings of yellow-headed gannets beat overhead as my father and I follow a silent call to Percé's five-hundred-metre limestone monolith: the famed Rocher Percé. Follow our tracks, and you’ll find the path to the great colossus barred, with all sorts of silly warnings given, like “danger: deadly rockfalls” and \"do not, under any circumstances, approach.\"\n\n![image](/works/writing/mathnews/gespeg-2-1.png)\n\nMy father can’t read French. We approached, on a quest to the monolith's hollow eye. We weren’t the only ones; back then, at low tide, crowds of curious tourists would span the sandbar, approaching the Rock’s towering edge. Most would reach it, astutely realize that the sandbar stretched no further, and satisfied, turn around. But the call was too loud; my father and I could not. Looking carefully, they should have seen the small pebble beach extending along between the Rock and the waves. At its end, the waters left no more but a debris field of chunks of stone protruding from the waves. The handful of remaining tourists would see it, be satisfied, they'd turn around.\n\nMy father and I could not. He leapt onto the first protruding stone. Then the next. I followed. Together, we would make chains of hasty, rhythmless leaps, only to pause, recenter and leap again, an Arrakis sandwalk on Atlantic stones. One or two remaining tourists would journey atop the stones, but inevitably, become satisfied, and turn around.\n\nWe could never turn around. Two children on the rocks, we followed a whispered call, the alluring song that ever since I first stepped out onto those Atlantic rocks, has left its hooks in my soul:\n\nSee.\n\n## THE DEMAND TO BECOME \n\nAnd so, eight years later, we ran. Leaping from boulder to boulder, careful not to slip among the ancient erosion eating barnacle-filled crevasses into the smooth, red-orange curves underfoot, my father and I would see. Years of coastal erosion had eaten away at Percé’s southern cliff, leaving a debris field of red sandstone and shale. Beachgoers sunbathe on the distant smooth slopes, but our beach was this one, the coastal invitation, the challenge: prove yourself free.\n\nLike children fearing imagined lava, we throw ourselves between the stones. With each step, my legs demand rock sink into the ground, its equal and opposite rebellion propelling me along the coppery shale path, at each landing, a battle of forces threatening to pull me in. My hands claw against the rockfaces, their rugged surfaces bite into my palms: pale flesh against one thousand maws, infinitesimal corners of stone. My upper body slams into wedged vertical boulders, the Earth carves crimson from my calves: liquid tribute drawn into the shale. \n\n![image](/works/writing/mathnews/gespeg-2-2.png)\n\nWe trace two paths, my father and I. Our minds race: where to stop, where to leap, where to claw, twist, rotate, eject, slam, scale, repeat, amid it, thoughts retreat. We become living motion, force manifest. Days before the end we wouldn't voice, we followed the land’s challenge, the lesson written in shale:\n\nFeel.\n\n## A QUESTION BETWEEN INFINITIES\n\nSo in the night, I felt. As midnight cold settled upon the town the night before we finished our Eastern quest, I sat upon the Percé beach, peering into the beyond.\n\nPercé’s beach is pebbled, and in the day, you see only the surface. At night, each pebble is inescapable; endless ancestors constructing the shoreline, only today’s generation open to the sun. In the day, the coastal stars were unseeable, hidden by waking life. But at night, each one sparkled at those sat upon the Earth’s edges, ever watching above. There, atop ancestor stones, below unreachable stars, a maroon hoodie from South Campus Hall.\n\nBetween the infinities, as the tourist town finally slept, the heaven beyond the Appalachians came to life. No more trying to outrun it, no more loud music, logistics, cars, no more metal at all. No more restaurants, roads, motion, no more flight. Only waves, pebbles, stars, and the wind. \n\nIn the end, tried as we did, there was nowhere left to run.\n\nSo I posed the question to the infinity. The question that, unanswered, had driven my family to return again to this sacred place, this far side of the Appalachian wall. \n\n![image](/works/writing/mathnews/gespeg-2-3.png)\n\nWrapped in midnight, answers came in a soft hush under the waves. \n\n## A LESSON ON THE MOUNTAIN\n\nI followed its advice. With my last free hours in Percé, I climbed the mountain to visit an old friend. Eight years ago, I remembered her to be magnificent. Cristo Redentor of Brazil, hidden in the Gaspésie.\n\nYet her home is no Elysium. I found her in a clearing of unkempt wildflowers and wheatgrasses, with patches of red gravel interspersed. She has no royal marble pedestal; all her pews rest upon grey and ancient wood with wildflowers growing between the planks. The pews aren’t well cared-for; each sun-baked seat is misaligned and nailed down imprecisely. She’s up high, yes, but it’s mostly from the concrete stairway she stands on, with flaking black-painted railings and chips in the stone to reveal its gravelly flesh. \n\nShe’s not magnificent either. Atop the pedestal, she’s so small. Only double my height, I think, and time has taken bites out of her painted white to reveal a porous interior, a milky core, pebble-pocked. Her halo isn’t resplendent, it’s barely held together: a circle of old halogen bulbs, the vast majority shattered long ago. Nor are her arms outstretched in glory.\n\nThey’re sheltering a marble-carved child, held tight to her chest.\n\nAtop the mountain, sitting at her feet, close your eyes and listen. As the wind brushes through the pines, you’ll hear it whisper a small, priceless thing.\n\n“I have you.”\n\n![image](/works/writing/mathnews/gespeg-2-4.png)\n","At the eastern tip of the Gaspé Peninsula lies the small town of Percé. Long ago, it was a bustling hub of the fishing industry, with lobster trapping vessels arriving daily and trains rushing through the trees. The fish have left now, and the train line has been washed out for years, but the town, and the rock for which it’s named, remain. Interested? Then pack your clothes, snacks, and the framed—\n\nPercé, here we come!\n\n## ONE DOES NOT SIMPLY…\n\nFrom Waterloo to Percé is a sixteen-hour drive, and with the train line decommissioned, the quays shut, and the nearest airport hours away, that’s the best way to get there. It's best split into two days—day one: race down an empty Highway 407 at 7:00 AM, and don’t stop until you reach Québec City.\n\nDay two: leaving the corridor. To begin, you have to drive until the end of the highway—truly an undreamt-of thing. Drive through the countryside for a little more, and you can stop at Mont-Joli to eat lunch on a coastal rock overlooking St. Lawrence’s ever-widening divide. A nice place to stop and think about—\n\nBack on the road again! Next, you enter the Appalachian mountains in earnest. The path takes you through seaside town after seaside town, often along roads parallel with the waves: open seaway on one side, and on the other, rolling, slumbering primordial gods of red sandstone and shale. Earth, risen to meet the sky. \n\nIt’s around the time that your Ontario-spoiled sense of scale starts to adjust that the road ahead takes a sharp upward turn. For the next three hours, you’ll trace a snaking, spaghetti-noodle line between the mountain slopes. The constant ups and downs become so common, your ears don’t have time to pop in a valley before you ascend the other side. My dad, a talkative driver, stops engaging in conversation around this stretch. I turn to see if everything’s okay, and past him, the ocean's level surface cuts across the window at a twenty degree angle. Not a time for distractions—\n\nThey level out! Finally, you pass the first sign. Grande-Vallée, GASPÉ.\n\nThose not familiar with this journey won’t realize that the sign saying “you’re in Gaspé, the nearest city to Percé” means “fuck you, you’re not even close.” \n\n## GASPÉ, GASPÉ, GASPÉ\n\nIn the Gaspé Peninsula, they live in blissful ignorance of the concept of a municipality.\n\nKitchener Line enjoyers will be familiar with the towns of Acton and Georgetown, both of them stops between Guelph and Greater Toronto. I gladly stand by the argument that everything out to Mount Pleasant is Toronto, but I think it’s a stretch to try to argue that this extends to Acton and Georgetown. They’re obviously independent towns, neither Guelph nor Toronto.\n\nThe peninsula disagrees. Every isolated cluster of houses within thirty minutes of the city of Gaspé is, somehow, also Gaspé? You finally reach Gaspé, Gaspé and somehow, you’re still not in Gaspé. It takes another thirty minutes of driving through Gaspé (region), Gaspé (peninsula) to reach Gaspé (city), Gaspé (region), Gaspé (peninsula), and another thirty minutes to leave Gaspé, Gaspé. On the upside, the moment you’ve left Gaspé, Gaspé, you’re immediately in Percé. \n\nSome would say it’s the first sign things are different out here. The first—\n\nDid I say you’re immediately in Percé? Just kidding. It takes another hour to drive to Percé, Percé. Didn’t you hear the local motto? It’s “fuck you, you’re not even close.”\n\n## THE BEACH TOWN AT THE END OF THE WORLD\n\nImagine a nightmare-journey Gaspésian equivalent of Ontario’s Grand Bend. Welcome to Percé. When you reach it, there’s only one road, sidewalks lined with tourists from the fully-booked motels, hotels, and campsites calling Percé home. Good luck driving. Why don’t you want to slow—\n\nYou’ve made it! Want dinner? Every restaurant has a line. Every. One. Maybe you’d like to just drive to the nearest town instead? Fuck you again, Gaspé is an entire hour away, and the main road back to Gaspé is up a hill with an 18% grade. Why do you want to run—\n\nRestaurants are out! Maybe you can just go to the grocery store? Percé only has one, behind a decaying barn, and it sells normal bell peppers for eighteen dollars a pound. None of this was unexpected—\n\nAttractions! There’s a mountain to climb: about halfway up, they’ve installed a lookout point where they charge $15 / person just to walk on it. There’s a fifteen-metre hill they call Mont-Joli—that’s a capital M—with a massive white cross atop it, and there’s a charge to even approach it. They’ve closed off the stairs to the famous rock of Percé, and there’s someone demanding $10 just to take a picture of it. But we have memories from last—\n\nWhat are you going to do? Leave? Really? Do you remember the drive? You’re at the tip of the peninsula, barred by a mountain on one side, water on the other, massive hills on every road, and that’s not mentioning the barely surmountable wall of Appalachians separating you from civilization. There’s no way out. You’re at the end of the—\n\nBut aren’t you happy? Isn’t this what we came for? Isn’t this why you set out—home is too far away to return anyway. Look at all these happy people—there’s nothing to worry about here—where do you want to—everyone is here—why do I feel so small? There’s no leaving now—is this what the lobster feels like—want to go to the rock? Shouldn’t we visit the stone—why are you so quiet—is this what the lobster feels like—look at all the souvenirs! Why is everyone so quiet—but the view is so gorgeous—I didn’t think it would be so soon—is this what the lobster feels like—\n\nPercé! It’s been in the lobster trapping business for centuries.\n\nBeyond the Appalachian wall, you’ve nowhere left to run.\n\n![image](/works/writing/mathnews/gespeg-1.jpg)\n[caption](the Appalachian Mountains, and all we do to hide therefrom)\n","Picture this: it’s 9pm. You’re in Toronto for a company onsite. Hurricane Beryl’s last exhale has finally blown over the city, and you’re trying to reach an AirBnB you reserved online that, for all you know, might not even exist. Who can say without having seen it. It’s an easy ride along Line 2 to get there, but with the rain having let up, every building, every brick, every rail, every stone gains new depth.\n\nAs though for the entire city, someone had spellcast it into colour.\n\nYou end up walking for almost half the journey. Red neon signs shelter every kilometer as you turn away from the holes through which commuters come up for air. Stores shut as you pass, the city locks itself tightly, seeking small shelter before the day begins anew. Laughter rings out from the bars, and still, on lucky occasion, the nails of panting dogs click along the sidewalk tiles below. All the while, the blanket of the moon and stars settles over the landscape, casting the streetscape into shadow, hue, and memory.\n\nThe night grows too dark, and you take the subway. _You emerge into a cold, dark, and quiet street. Clueless as to your destination, you follow through the darkness until you’re brought to an open door. Through tight stairwells and carpeted floors of your grandparents’ time, you’re welcomed into the home of strangers. People you’ve never known. The incandescent golden light of the urban hearth hallows the cold exterior, and amid the unknown darkness, there’s safety._\n\nYou cross out from under the streetlight’s golden glow. Only your footsteps echo against the ground, disturbing the slumber of a city that never sleeps. A bird chirps goodnight, and the next subway rumbles beneath. Another wanderer emerges from the side street, leash in hand. You look down, _and understand why that golden space feels like home. In that space, the eyes of their dog stare back at you, infinite yet without secrets, they join with his smile of childlike joy. You pet hair softer than the fresh-fallen snow; though not peaceful, he’s peace-bringing all the same._\n\nThe wanderers pass by. You search the night for the sidestreet of your destination, and your eyes glance over the signs of darkened stores. A high-end school _you’d all made fun of the next morning_. A subway station containing trains _they tell you the dog loves to ride_. A pet supply store _you’d explored, all five of you, dog included_. _Each moment a glimpse of a stranger. Each moment the gift of trust._\n\nAll the while, your eyes search. A single glimpse of white fur, a single step of the people you’d so briefly known. The friends of a past time. Does it make sense? What would you even say? If you waved, would they even wave back? \n\nIs this, too, lost?\n\nEventually you make it to the AirBnB. It’s cozier than you could possibly imagine, a basement studio with a turquoise kitchen from a time when spacefaring was a dream that seeped into all things. You reconnect, self-actualize, respond to an email from a worried incoming first-year. The next morning, under the morning sun, you journey again. For all the journey’s mortar and grime, there’s nothing else like it. You breathe deeply of every second. Even of the frantic return trip to the AirBnB in the late afternoon to retrieve your forgotten jacket. Yet with all the completeness of the open road under your feet, your eyes search still.\n\nHurrying back to the train station, you pass by a cafe, _and hiding deep within from the morning light, you enjoy brunch like you’d not had in years. The four of you talk about the city, about the world. About those they see as instruments of oppression. Despite your efforts to be unconditionally agreeable to your overnight hosts, your words betray your disagreement without you even knowing it._\n\n_“New queer or country queer?”, they asked about you after a moment’s pause. “Country”, your partner at the time responded for you. The conversation moved on._\n\n_Minutes later, you would figure out what had happened. Days later, you’d still think about it. Weeks, months even, before you register the way anger had skipped the disagreement. Rebuttal, conflict, dropped to make room for background. For making time to understand you, despite your differences._\n\n_For the empathy of someone good._\n\nThe GO train’s engines kick online, and the skyline accelerates past.\n\nThe moments of kindness remain.\n","Back before the sun decided it wanted to kill us all, some friends and I went on a walk to St. Jacobs Market. We went at it a bit lopsided though; instead of emerging by the market trail, we accidentally came to the edge of the city about a mile west of Weber street. There wasn’t any warning we had reached the edge; the suburbs kept going as usual until, suddenly, they stopped. Cornfield on one side, houses on the other. We stayed on the side of the houses. The renowned mathNEWS contributor, excellent friend, and Torontonian among our group, \\_\\_init\\_\\_, told us that for the longest time, they’d never realized that the city had an edge to it.\n\nI think about that a lot.\n\n❦\n\nI’m going to pose you a question. Think long and hard before you respond. It’s a subject of divisive, intense discourse among all walks of life: academics, politicians, students, scientists, family, and friends alike. Sit down before you read it. This is your last chance to turn back.\n\nStill here?\n\nGood.\n\nIs there anything north of CLV?[1]\n\n❦\n\nUnlike \\_\\_init\\_\\_, I’ve never been a Torontonian. I remain convinced that Richmond Hill is a made-up place, and Etobicoke is definitely just west Toronto. Worse, I’m actually not sure whether that second statement is controversial or not.\n\nI grew up at the edge of the world. On the dividing line between urban infrastructure and the unassailable seas of verdant corn. But even then, just barely. The urban infrastructure was on the other side of an impassable river; we were the first outpost amid the cornfield. The edges of our world were on all sides, and easily found.\n\nOne of the most recent times I was home, I went for a walk to the furthest edge of the world. I’d discovered a long time back that there’s a trail you can take beyond the border of the suburban outpost, walking to the furthest edge of our sister town. The trail ends at the sister town’s westernmost highway. There’s a gated driveway to someone’s house on the other side, sure, but they wouldn’t appreciate tourists. There’s no footpaths to take beyond the westernmost highway. No escape.\n\nIn my mind, I’ve named it the edge of the edge of the world.\n\n❦\n\nI don’t like letting important dates pass by uncelebrated. When the summer solstice came[2], I left my place about thirty minutes before sunset, and went for a walk towards Columbia Lake. The skies put all their best sunsets at Columbia Lake. By the time I had reached Columbia and Westmount though, Columbia Lake was in the opposite direction of the setting sun. I couldn’t turn away from the sun. It was the solstice.\n\nIn an unparalleled act of bravery, I crossed the road to CLV. It’s a nice area. Weirdly suburban. If it weren’t for the Waterloo-branded signs everywhere, you could almost forget you’re walking around a university residence. In positive news, I didn’t immediately die upon going north of Columbia. I’d never tested that before.\n\nThe sun did immediately set though.\n\nI always thought CLV would be bigger. It’s surprisingly small. If you’re walking north and west to keep the cloud-covered sunset in view, you’ll cross through it much faster than you expect. Soon the sun is down. Soon the solstice is over. Soon you’re on the northern side of CLV.\n\nThey say the solstice is a time of new beginnings. On a planetary scale, it’s the beginning of a new phase to the cycle. It’s avoidable, but also undeniable.\n\n‘They’ is me. I don’t think I’ve ever actually heard anyone say anything about the solstice. But if they did, I think I’d like them to call it a time of new beginnings. A time wherein you can look at things from a different angle. Turn the world in your hand, and see entire surfaces you’d never seen before.\n\nWe need those every once in a while.\n\n❦\n\nLast time I was home, I walked to the edge of the edge of the world. Then I crossed the road to the other side. There’s a relief to it, a safety in the knowledge that you can get out. That the world exists on the other side. It’s on the other side of the road; you’ll return to it eventually, but for now, it’s there, and you’re here. Beyond the edge of the edge of the world.\n\n![image](/works/writing/mathnews/edge-1.jpeg)\n[caption](pictured: the edge of the edge of the world)\n\nRoads continue past the edge of the edge of the world. Cars still drive, deer still run. If you keep walking, you can make it to the next town. To the next edge. Then the next.\n\nIf you travel beyond the edge of the edge of the world, you may soon find a copper palace on the far side of an open field. At the palace's rear lies a tower, a rectangular obelisk some eight stories high, with a foyer at its base shaped like an artisan-cut jewel. In the night, light streamed out of its windows, bathing the neighbouring gardens in brilliant gold. From a distance, it is strikingly out of place. Acres of ponds and green fields, and at their furthest end, like it has been plucked from the sky and placed on Earth, an unmistakeable Camelot.\n\nWhen the summer solstice is done, and you’re holding the world in your hands, you have the opportunity to turn it, to look at your world from a different view. Sometimes you’ll stop seeing old things. Sometimes you’ll see them still, but in a different light. Sometimes, you’ll be surprised by the new things you’ll see.\n\nIn that moment, you may just feel the most beautiful feeling in the world:\n\n![image](/works/writing/mathnews/edge-2.jpg)\n\nWhen the **_fuck_** did that get there?\n\n--postscript--\n\n1. Columbia Lake Village - the residence northwest of REV. West of MKV. West of V1. Really west of SLC. They actually decided to put students out there.\n2. The summer solstice did not, in fact, come that day. I don't know how to read a calendar. It was the day before.\n","it’s not the totality.\n\nit’s not the black dot inverted of the sun, nor the frosted crown encircling the moon. \n\nit’s neither the faint cold that takes rest upon your skin, nor the odd calm that \n\n> seems to muffle the sounds of main street, bustling moments ago.\n\nit’s not the way you hold close to your friends, like danger lies in moonshadow.\n\nit’s not the way your lungs can’t quite fill, whether that be from excitement, or from fear.\n\nit’s not the radiation-yellow sky on the western horizon. it’s not the canvas in the clouds, not the pairing of daylight and midnight colours:\n\n>\timpossibility made real.\n\nit’s not the aimless firefighters, awaiting outside the firehall the quiet of the eternal flame.\n\nit’s not even the crackle of fireworks, jealous in the distance.\n\n[linebreak]\n\nit’s not the ghostly light emanating from the clouds.\n\n> nor the sorcerer’s eye peering in.\n\n> the piercing gaze of the omnipotent.\n\n[linebreak]\n\nit’s the way that five minutes later,\n\nyou’re walking down Highway 20, Pelham, Ontario\n\ndiesel-guzzling pickups storm through the nearby intersection\n\ntim hortons and gas stations and pizza restaurants passing by\n\nthe firefighters have gone back inside\n\nand when you look at your feet\n\ndiscarded water bottles and paper scraps line the sidewalks\n\nyou haven’t really moved\n\nbut the universe is satisfied\n\nand the moment has moved on\n","In mathNEWS 154.2, Lars Nootbar wrote of Tucker Carlson's obsessive hatred of modern day M&M's. The article was excellent, but surely, Tucker Carlson’s rants about M&M’s being a symbol of the downfall of freedom are entirely unfounded, right?\n\nNo. The M&M's machines are watching you.\n\nOn Saturday February 10th at 8:16 PM, r/uwaterloo user u/SquidKid47 posted a picture of a strange error message found upon one of the ubiquitous canary yellow M&M's machines[1]:\n\n```\nInvenda.Vending.FacialRecognitionApp.exe\nApplication Error\n```\n\n## WHO ARE THE COMPANIES INVOLVED AND WHAT DO THEY WANT WITH YOUR FACE?\n\nLet’s take a few steps back. What exactly are these vending machines doing, and who is responsible? mathNEWS investigative journalist firstie contacted Plant Ops, who claim zero involvement with the vending machines. This leaves operational responsibility with the company operating the machines: Adaria Vending Services.\n\nAdaria does not make the machines; firstie determined the machines’ original manufacturer to be Invenda Group, an organization boasting intelligent vending machines with data collection capabilities[2]. Some data collected is benign, including sales and UI performance metrics. But Adaria can also use these machines to collect further data, sending it to relevant parties including Mars, the manufacturer of M&M's. In particular, Invenda's sales brochures state the machines are capable of sending estimated ages and genders of every client.\n\nThis sounds familiar.\n\n## CADILLAC FAIRVIEW’S DEMOGRAPHIC DATA COLLECTION AFFAIR\n\nSix years ago, Cadillac Fairview (CF)[3], owner of landmark shopping malls across Canada, became mired in controversy when the CBC discovered them to be using facial recognition software on unsuspecting patrons. Across eight weeks, they collected data on 5,061,324 patrons using secret cameras hidden within their malls’ informational kiosks.[4]\n\nSound familiar?\n\nIn the privacy commissioner of Canada’s subsequent investigation, it was revealed that Cadillac Fairview used the kiosks’ facial recognition capabilities for similar goals as Invenda machines enable: demographic data collection on users’ ages and genders.[4]\n\nFacial recognition software isn’t inherently malicious. Many use Apple’s Face ID every day. The key is that in such situations, the individual provides express, meaningful consent. When personally-identifiable biometric data is used without express, meaningful consent, it often constitutes a privacy violation.\n\n## A RESPONSE FROM ADARIA VENDING SERVICES\n\nWe could not responsibly publish this article without providing Adaria Vending Services the chance to respond. Below is their Director of Technology Services’ unedited response.\n\n> What’s most important to understand is that the machines do not take or store any photos or images, and an individual person cannot be identified using the technology in the machines. The technology acts as a motion sensor that detects faces, so the machine knows when to activate the purchasing interface—never taking or storing images of customers. In partnership with Mars and Invenda, these machines are fully GDPR compliant and are in use in many facilities across North America.\n\n> At the University of Waterloo, Adaria manages last mile fulfillment services—we handle restocking and logistics for the snack vending machines. Adaria does not collect any data about its users and does not have any access to identify users of these M&M vending machines. \n\nAlthough Adaria may not personally collect data from the machines, that does not prevent Invenda from collecting demographic information. Neither does it prevent Invenda from sending this information to M&M's manufacturer Mars.\n\n## A CONTRADICTORY RESPONSE FROM INVENDA\n\nTwo hours before the mathNEWS publication deadline, we received the following response from Invenda's Founder and Executive Chairman:\n\n> As the producer of the Invenda loT solution, the Invenda smart vending machine, and its associated software, we formally warrant that the demographic detection software integrated into the smart vending machine operates entirely locally. It does not engage in storage, communication, or transmission of any imagery or personally identifiable information. The software conducts local processing of digital image maps derived from the USB optical sensor in real-time, without storing such data on permanent memory mediums or transmitting it over the Internet to the Cloud.\n\nThey go on to say,\n\n> It is imperative to note that the Invenda Software does not possess the capability to recognize any individual's identity or any other form of personal information.\n\n> Further, Invenda's smart vending machines and its software are compliant with General Data Protection Regulation and equivalent data privacy policies.\n\nOn an attached FAQ sheet, they also state that \"only the final data, namely presence of person, estimated age and estimated gender, is collected without any association with an individual.\" The document continues,\n\n> **FAQ:** Do Invenda clients exclusively obtain anonymized analytical outcomes, such as usage frequency within specific\ndemographic trends, sales statistics, etc.?\n\n> **Answer:** Clients are furnished with anonymized data analyses.\n\nWhile Adaria claims the machines take no images of customers, and has no demographic imaging capabilties, Invenda contradicts them in saying they do—however, relevant data is only used locally.\n\nIn the Cadillac Fairview investigation, CF initially claimed their system did not store facial recognition data. Only through the investigation was it discovered that CF's vendor kept a database containing facial embeddings of over five million nonconsenting Canadians.\n\nCaution is warranted.\n\n## THE ARGUMENT FOR EXPRESS, MEANINGFUL CONSENT\n\nCadillac Fairview could have avoided controversy had their kiosks informed users facial recognition was in use. They did not.\n\nIn the privacy commissioner’s report, the commissioner emphasized that “shoppers had no reason to expect their image was being collected by an inconspicuous camera, or that it would be used, with facial recognition technology, for analysis.”[6] No one expected the M&M's machines to have cameras. The commissioner further decried “the lack of meaningful consent.”[6] No student consented to the cameras. Most relevant was the following:\n\n> “If Cadillac Fairview were to use such technology in the future, it should take steps to obtain express, meaningful consent, before capturing and analyzing the biometric facial images of shoppers.”[6]\n\nExpress, meaningful consent means two things. One, that the individual understands the full context of what they consent to. Two, that the consent is express—it is not implied, but rather openly given by the individual. \n\nAdaria’s Invenda M&M's machines fail both counts.\n\nOn campus today, Adaria’s machines can conduct the privacy violations Cadillac Fairview ran afoul of. With almost imperceptible cameras, they identify biometric information of M&M's shoppers without our permission. Never in the user interaction flow are we asked “do you consent to having your biometric data scanned?”, because ideally, we shouldn't have known we are being scanned at all.\n\nWhen Cadillac Fairview was caught using such practices, it was national news and warranted a privacy commissioner investigation. What will happen to Adaria, Invenda, and Mars?\n\n## WHAT CAN YOU DO?\n\nWhen the investigation concluded, Cadillac Fairview agreed to delete all information it had gained from the program. That was the limit of their punishment. Although the Personal Information Protection and Electronic Documents Act (PIPEDA) provides the ability to enforce fines on lawbreakers, no such measures were taken.[4] Canada shook its stick, and warned CF that should they try again, we will shake our stick even more firmly.\n\nWe are not so powerless. The University of Waterloo is an institution within which you have power. University administration often sounds deaf to our wants, but often, it is because there are needs they must counterbalance to our demands. \n\nNo one needs M&M's cameras. \n\nStudents can ask that University staff bar facial recognition vending machines from campus. Adaria’s Invenda machines can secretly read students' biometric data without our consent. With no consent, the M&M's machines' facial recognition follows in the footsteps of historical open violations of Canadian privacy law.\n\n--postscript--\n\n1. https://www.reddit.com/r/uwaterloo/comments/1anvv0q/hey_so_why_do_the_stupid_mm_machines_have_facial/\n2. https://www.invendagroup.com/vending-machines\n3. Owned entirely by the Ontario Teachers’ Pension Plan. I hope one day we find the Ontario Teachers’ Pension Plan has bought the entirety of Ohio.\n4. https://www.cbc.ca/news/politics/cadillac-fairview-5-million-images-1.5781735\n5. The GDPR is EU privacy legislation. Invenda is a Swiss company, hence, their machines focus on EU privacy law.\n6. https://www.priv.gc.ca/en/opc-news/news-and-announcements/2020/nr-c_201029/\n","In Math Coffee & Donut’s lower shelves of the middle aisles, you may find several multicoloured packages of peanuts. Not just any peanuts. Picard’s Peanuts. This begs the question:\n\nWhich Picard’s peanuts are they? Not which peanuts, mind you. Which Picard?\n\nIt’s not so simple. While Jim Picard Sr. initially founded the Picard’s empire that stretches across Southwestern Ontario today, his empire has since split in two. Go to the towns of Windham, Morriston, Fonthill, Fort Erie, Woodstock, or Arva, and you’ll find an iconic blue shed displaying proudly their “The Original Picard’s” logo. Go to Talbotville, Niagara-on-the-lake, Waterdown, Vaughan, or St. Jacobs, and you’ll find more iconic blue sheds with logos claiming to be “The Original Picard’s.”\n\nThey are different logos. They are different Picard’s. In fact, the rebellious second faction doesn’t even outwardly display that they sell peanuts.\n\n## A BRIEF HISTORY OF THE SOUTHWESTERN ONTARIO PEANUT FEUD\n\nIn 1978, a Simcoe, Ontario man named Jim Picard Sr. was struck with a brilliant realization: if peanuts are so good, why not grow them here? The next year, he launched Picard’s Peanuts Ltd., pioneering peanut farming in Ontario.[1] About a decade later, the Picard family released their greatest hit: a potato chip covered peanut, coined the “Chip Nut.” Business boomed; while the empire grew to eight locations by 2012, the Picard family grew to include four children: Jim Picard Jr., John, Renee, and Brian.\n\nBut in 2012, the Picard succession plan fell apart. While Jim Picard Sr. and Jim Picard Jr. stuck to their roots, John and Renee Picard sought revolution, with dreams of manufacturing chocolates, various other nuts, ice cream, and a craft beer. They brought half the business under their wing as “Picard’s Foods;” with no particular geographic split, each half of the business evenly covers Southwestern Ontario. This split was not amicable. In 2015, each side of the family used their websites to take pot shots at the other, claiming that the opposing side was “fooling” customers or “stealing” their original recipes.[2] Both sides have been certain to work the phrase “The Original” into their branding, despite the validity of this claim. The peanut feud had begun.\n\nIn researching this article over the past month, the manufacturing process remained unclear: are both Picard’s still using the same farms? The same facilities? Has even manufacturing fallen victim to the feud? I took an unprecedented step in my mathNEWS journalistic career and emailed a primary source.\n\n> Hello,\n\n> Sorry, I know its confusing. There was a split in 2012, so different stores have different ownership, including different manufacturing facilities. You will notice small differences with the packaging, and flavour ranges.\n\n> Hope this helps!\n\n> Picard Peanuts Ltd.\n\n## EXPEDITION: ST. JACOBS \n\nSourcing Jim & Jim peanuts involved a simple car expedition to Arva, Ontario’s familiar store, containing peanuts, some chocolates, and assorted British candies.\n\nFinding John & Renee peanuts, on the other hand, took your beloved reporter to the St. Jacobs peanut shed. Reaching the iconic blue building, you may do a double take when you realize that although the building is a Picard’s branch, nowhere on the outside is the word “Peanut” displayed. Over one third of its selection is peanuts.\n\nOnce inside, navigating their selection to find the Picard’s-famous Chip Nut was a challenge, given that they refuse to use the term “Chip Nut,” instead electing for “crispy potato chip covered peanuts.” They also offered several gift assortments, labelled the “Real Picard’s Gift Box” - the perfect gift for any family members deeply invested in the Picard’s feud. Significant shelf space was also dedicated to an assortment of Jesus-themed puzzles, a selection of sunglasses, more peace-and-jesus memorabilia, and several shelves of clothes for the Picard’s-adjacent Ramblin’ Road brewery. Jesus content. Brewery merch. Profit.\n\n## PEANUT VERSUS PEANUT\n\nWith the peanuts acquired, I called upon the refined palettes of mathNEWS’s writership. In contest were two varieties of peanut:\n\n- Jim & Jim’s Picard’s Peanuts - All Flavour Chip Nuts (1.33 ¢/gram)\n- John & Renee’s Picard’s Foods - All Flavour Crispy Potato Chip Covered Peanuts (1.25 ¢/gram)\n\nI went into the taste test expecting an overwhelming victory for Jim & Jim’s Chip Nuts, given their cohesive marketing and trust in their peanut offerings.\n\nNot even one writer preferred Jim & Jim’s Picard’s Peanuts.\n\nPoints to both teams were given by _Not a N\\*rd_ for the equal, perfect crunchiness provided in both variants of chip nut, as well as the overall taste being “surprisingly good.” _Lars Nootbar_, previously disposed against Picard’s Peanuts, described them as “not as bad as he remembers.” _no pun indented_ could not tell a difference between the two flavour blends, while \\_\\__init_\\_\\_ and _sexy_software_babe_ were disappointed in both peanuts for their audacity to taste like peanuts.\n\n_Lars Nootbar_ likened Jim & Jim’s chip nuts to potato chips and John & Renee’s chip nuts to trail mix. _rockfacts_ gave unique bonuses to each peanut contender: while they preferred John & Renee’s smaller variety of peanut, they gave equal points to Jim & Jim’s peanut flavouring. _yummiPi_ was confident they could put either chip nut in a salad. I too am confident _yummiPi_ could put either chip nut in a salad.\n\nFrom then on, it was a clean sweep for John & Renee Picard. All writers but two preferred Picard Foods’ revolutionary peanut. mathNEWS writers _aphf_, \\_\\__init_\\_\\_, and _sexy_software_babe_ found John & Renee to have the superior peanut flavouring blend, with _Not a N\\*rd_ praising its salt content and better aftertaste. Several writers argued that on visuals alone, John & Renee’s peanuts are the stronger contender.\n\n_Dick Smithers_, his Irish blood standing tall with the rebel Picard’s faction, set popcorn aside to pledge his unwavering conviction to John & Renee’s peanut revolution.\n\n## CONCLUSIONS\n\nWith a sweeping victory for John & Renee, the implications are clear: Waterloo students are being served an inferior peanut. Although I am eternally grateful our wonderful MathSoc business manager has brought Picard’s peanuts to our shelves, I humbly request that she consider switching to the Picard Foods crispy potato chip covered peanuts. \n","across the road from northfield station, there’s a trail outstretched \n\nto a market well outside the St Jacobs boundaries\n\n(they’ve named it St Jacobs anyway)\n\nthe government spent three million to pave it, celebrating its release with a sign declaring \n\n“do you love us yet?”\n\nno one takes the trail.\n\n❦\n\nthe first of its three segments walks you behind the unseen sides of the 401’s supplicants\n\nunseen but not hidden; there’s nothing to hide in the undecorated concrete,\n\nthe exposed dirt. the ribbed metal, so flat, making up the warehouses’ outer skin.\n\ngrass is overgrown on each side of the track, not because it is free to grow, \n\nit is just too irrelevant to cut.\n\nsegment rating: 5.3 / 10.0.\n\n❦\n\nin the second segment, a woodlot encroaches upon the surrounding warehouses’ unmanicured lawns \n\nand distribution centers whose names you could almost make out\n\nwere branches not disrupting your customer journey\n\nand muffling the roar of the monarch interminable, highway 85.\n\nthere’s no mutexes to synchronize the birdsong, but \n\ndepth-first search may work on the trees\n\nsegment rating: 8 / 10. \n\n❦\n\nin the third segment, leafy arms outstretch revealing an open pond on the far side of the salt line\n\nthe municipal trucks will not cross\n\nno one walks this far along the path,  save for the sparrows who hop out of your way, surprised to see you\n\nhow did you get here?\n\nbeyond the pond, where one last woodlot remains\n\nthey put up a barbed wire fence once to keep you on the trail, and if you really look, you can see \n\nits rusted memory\n\nsegment rating: good. \n\n❦\n\nif you decide to come back the same way, there’s a dirt hill minutes from northfield station, on the west side of the asphalt path\n\nit’s surrounded by posts so high and grandiose\n\nthe satellite’s eyes take note[1] of the lights atop each post, three apiece,\n\nall twenty-four face in, to light the pile of forgotten dirt, “This is our dirt. Do not disturb.”\n\n“Those who deface it will be noted.”\n\nthe dirt has since grown into a hill of wild reeds\n\nthe lights must have felt\n\nso terribly disrespected\n\n--postscript--\n\n1. https://earth.google.com/web/@43.50031156,-80.54556548,345.68555368a,66.58880838d,60.0000016y,-43.10932991h,66.97960662t,0.00000119r/data=OgMKATA\n","There had never been a mouse inside a great Arctic rainstorm. Mice are small, flimsy, and lack the fins or gills to allow them to swim proficiently, and should they try to stay out in a storm, they are sure to be swept away. This was to Mouse’s great dismay, who was ever an explorer in any other weather. When Owl told of the great coming rainstorm, Mouse was heartbroken that he could not see the storm himself. Bear often worked alone, but when he saw Mouse so dismayed, he resolved that he would change the world. He would show a mouse a storm.\n\nThree days before the storm, while the other animals built safety and hunted meals under the last hours of sunlight, Bear’s weathered claws dug into the permafrost-shielded ground. The animals lived on the flattest part of the land turtle’s shell; when the stormwaters came, the icy plain would become flooded over, with all small creatures washed out to sea. With a mound of dirt free, Bear padded the dirt into a small hill, sure to crest above the floodwaters when the storm beckoned them to rise. Bear said to himself, “This is how I will keep Mouse dry.”\n\nBut as Bear lumbered home that day, he realized that water would come above as well as below. Mouse could not stay dry alone, yet so long as Bear could shield against the rain and the winds, Mouse could see the storm. Two days before the storm, Bear sought out tree branches under a boiling grey sky. He set them around his hill as supports, so he could lean in any direction from the hilltop and feel the Earth hold him upright. Bear said to himself, “This is how I will keep Mouse dry.”\n\nBut as Bear lumbered home that day, he realized that he had never seen underwater, and as his face fur got wet in the storm, he would be completely blind. On the last day before the storm, when the plains grew quiet and the skies grew dark, Bear ventured to the sea. From morning into twilight, he brought his head in and out of the water, each time opening his eyes wider. And when he could look into the depths, unafraid of the water, Bear said to himself, “This is how I will keep Mouse dry.”\n\nBear returned to the cave that evening, and only hours after he returned, the animals heard the rain begin. The other animals cowered, but Bear found Mouse peeking out from the cave entrance. “Come,” rumbled Bear. “I will show you the storm. I will keep you dry.”\n\nTogether, Mouse and Bear left the safety of the cave. With the rain building around them, they reached Bear’s hill, the branch supports around it sticking out as a crown. Mouse scampered up onto the hill, Bear stood firmly above him, and the two began to water.\n\nIn a growing chorus, the storm fell upon them. Rain fell in heavier and heavier sheets, and what had once been Bear’s hill became an island in a dark and unforgiving sea. Lightning crashed down to the plains around them, and where trees could once be seen in the far distance, only stumps remained. Winds screamed in their ears, as the sonorous beats of the Great Birds’ wings thundered across the land. But Mouse was dry. As the waters rose higher, from the dirt watchtower, Mouse looked out across their boiling waves as no other mouse ever had. As the winds grew stronger, safe under Bear who leaned against his branch supports, Mouse saw sheets of rain as no other mouse ever could. As the lightning grew more constant, Mouse looked to the sky to see brilliant green and purple magnetism intermix with lightning’s harsh strokes, drawing a canvas no other mouse would ever see.\n\nMouse could see the storm.\n\nCrack. Mouse jumped, searching in the darkness only to see one of Bear’s supports snapped and swept away. Crack. Crack. With the first branch gone, more soon followed, snapping and sailing away until only Bear and Mouse remained. Both looked into the dark, and as the rain dampened for a brief moment, a web of lightning broke across the sky. Wings of electric light stretched as far as the eye could see, the aurora become feathers viridescent and rose, the moon and brightest star become a pair of eyes.\n\n_SHELTER_, commanded the wings in the sky. The lightning vanished, and as its thunder arrived, a great gust of wind blasted Bear into the sea.\n\nMouse flew.\n\nThe hill was empty.\n\n❦\n\nBear’s head thrashed out from the floodwaters, and he clawed back atop his overlook. Mouse was gone. Bear searched the darkness, seeking some sign, a claw, a tail, any hint of a mouse. He submerged, and amid the rushing floods, a hint of fur shone out before disappearing out of sight. Bear charged, fighting the water’s current, each step a battle as he chased signs of Mouse along the flooded plain. Closer, closer he came, until he had Mouse within striking distance. Bear opened his jaw, and ripped Mouse from the waves.\n\nBear sprinted back to the cave, and with the other animals gathered around in shock, he coughed up water, ice, and a wet, saliva-coated mouse.\n\nMouse’s eyes shot open. The animals of the cave gathered around him; Elk directed animals to get food and warm leaves to nurse Mouse back to health. Soon, Mouse was carefully wrapped in leaves with berries aplenty to nurse upon. Hearing Mouse quietly chittering, Bear lumbered to the back of the cave. With a sigh, he dropped to the cave floor, lying his head flat against the stone. \n\n“I’m a failure.” thought Bear. “I couldn’t keep Mouse dry.”\n","You're in Toronto on an overcast November morning. You’re walking along Bloor Street when you find a cute little bookstore with an open door in three degree weather, and although you take a few steps beyond it, you’re inevitably pulled in. Inside, books in tight hallways rest on shelves stretching floor to ceiling without order or organization, the room so tightly packed it threatens to cave in on itself. The clerk, a bearded man who could have been a lumberjack had books not called him first, says to ask if you have any questions, and you don’t until you reach the back of the store and find stackable containers in an unreachable corner, floor to ceiling, each filled overflowing with multicoloured Lego bricks. You walk back to the desk, dodging the Lego shelves you didn’t see before, rotating around the Lego aisle endcap and its Lego signage to ask the man: what’s with all the Lego, hidden among the dusty books but so bright once you’ve seen it. And as he tells you, you look down.\n\nHis desk is made of Lego.\n\n❦\n\nA wise man told me years ago that “if you’re bored, you’re boring.” I haven’t found him to be wrong yet.\n\n❦\n\nYou keep walking down Bloor. You’re in Koreatown now, but you’re not from Korea, and you’re not really from a town either, so you’re not only out of your element, but you also can’t read for shit. But the winter air is clear, and as you take in the sights—the “magic health” stores selling weight loss and laptop repairs beside the corner grocery markets with tomatoes piled under the winter sun—you find a familiar park. You detour in; the relatively small Christie Pits park has only a few softball diamonds and playgrounds, but though it’s unremarkable, you’ve heard the warning of its history every day of your life, every time the Tragically Hip etched the park’s race riot of “that night in Toronto” into odious legend. You tread across this birthplace of old hate, years of history underfoot. \n\nYou're amazed, because you never meant to be there at all.\n\n❦\n\nOne of the best parts about living in Waterloo is that you don’t have to live in Waterloo. Yes, your bed is here, you generally return here each night, but that’s not completely restrictive of what you do in the day. You can start your day in Waterloo, go almost anywhere in the GTA for lunch, and return to Waterloo at night without anyone having to know. \n\nOnce every few months, I get the feeling I’m not using that ability enough. \n\n❦\n\nYou eventually reach High Park, the destination you had been searching for; your task is complete. It’s not your first time in a forest, but there’s something different about this forest, its colossal trees and untamed valleys, that leaves you intimately aware of its age. You walk along the leafy paths as the trees whisper shadows of days before, of many lives lived under their ancient watch. You journey further into the trees, and on the path before you, a golden lab in a strawberry bowtie guards the path beyond. You lock eyes. She runs away. You follow her, as you do, the trees part to reveal a sandy hill populated only by dogs, running and playing in every direction.\n\nOut of nowhere, a black lab lovingly tries to tackle you to the ground. \n\n❦\n\nI had a free weekend coming up, and not a single plan for it, save for doomscrolling Instagram and aimlessly exploring Starfield until Monday morning rose. It was Remembrance Day weekend, so I’d try to break it up by going to the cenotaph ceremony.\n\nThere’s a cenotaph in Toronto, right? To get there on time, I’d need to wake up at 6:30 on a Saturday. But I’m not doing anything else, and I can sleep on the train. The ceremony would be done by noon, but High Park is right there; why not explore? If I am to be bored, it will only be because I have rejected the vastness of life for isolated decay. If decay is the alternative, why not choose rejuvenation? If death is the alternative, why not choose life?\n\nI buy the GO Transit day pass.\n\n❦\n\nYou’re not at High Park yet, and after detouring through Christie Pits, you desperately need lunch. You pass many places offering food, but none feel quite right, not quite replenishing of the body and soul, until you find a poorly-marked shawarma restaurant. It offers “East African Cousine.” So you walk in, into a restaurant with a haphazard menu and a single TV stuck to unbranded brown walls, and you order your shawarma wrap from a man who seems confused you that you're in his restaurant at all. You sit down, out of place, unsure where you are, less sure where you should be.\n\nAnd here you are. You’re who knows where along Bloor St, your destination either near ahead or long behind, you cannot tell. You’re a lost Waterloo refugee, in the heart of a community that isn't yours, with decorations on the walls in a script you cannot parse, watching a soccer game on the muted TV between teams only you don't recognize in a language only you don’t understand. And you know just one thing:\n\nYou’re not bored. You're more alive than ever.\n","Inspired by _Dick Smithers_’ \"Comprehensive Review of Crush Social Eatery\" in mathNEWS v153i3, I recently set out to experience and comprehensively review the new shawarma restaurant opened on Philip St across from Molly’s, Tahini’s. \n\nTahini’s is the latest shawarma establishment to compete for the denizens of the university plaza. They have over 28 locations across Ontario, and originally hail from (the other) London. As a London escapee, this new Philip St location brings back memories of meeting last-minute dates amid the aroma of falafel and the lights of the Bitcoin ATM their London locations were famous for.\n\nThe new Tahini’s on Philip St doesn’t quite have the same atmosphere, but the menu remains strong. They’re still in the early stages though; their service is abysmally slow relative to FreshBurrito or even Shawarma Plus, and their packaging could use some work - they don’t even give you a bag or napkins, they just hand you the minimally-wrapped shawarma and wish you a nice day - but with time, it has potential to live up to its London reputation. Maybe they’ll even raise their “Order here” sign after some time; I hit my head on it while trying to get to the counter to order. \n\nThat’s basically the entire review. They need a while to get things together, but with time, I believe they’ll be able to give Shawarma Plus a run for their money.\n\nCan we revisit that Bitcoin ATM? What the _fuck_ is up with that?\n\nHow often do you see a Bitcoin ATM? Maybe in the back corner of a shady convenience store, or in a forever-empty currency conversion shop in some forgotten nook of Conestoga mall. Shawarma restaurants can often be liminal spaces, but there are limits, and Bitcoin ATMs are well beyond them. Maybe, maybe if you want to order 3526.429 chicken shawarma wraps[1], you can order them with a Bitcoin, but have you considered at that point just buying the restaurant instead?\n\nThat’s not it though. The below image is a [real t-shirt you can buy on Tahini’s’s website](https://tahinis.com/products/bitcoin-fire?variant=39405576060973). This is not a joke. This is real Tahini’s branding.\n\n![image](/works/writing/mathnews/tahinis.png)\n[caption](A core part of your next halloween costume.)\n\nIt doesn’t stop here. The reason for all this Bitcoin branding?\n\nEvery dollar they put into long-term reserves[2] is invested entirely into Bitcoin.\n\nThis is an insane business play. Almost all Canadian organizations keep their savings in $CAD or $USD, both of which being reasonably-stable options for long term savings. Time value of money aside, if your business puts $50 CAD in a savings account in 2020, they can reasonably expect to still have about $50 CAD in that savings account by 2023. Not Tahini’s. In August 2020, they moved _all of their long-term corporate balance sheets_ to Bitcoin. \n\nWhen Bitcoin crashed in mid-2022, they would have lost around 66% of their earnings from 2021. For a chain of their size, that is probably enough to pay the full tuition of every Math/Teaching student at the University of Waterloo today. Randomly gone. Oopsies.\n\nI want to be able to make this out to be a poor decision. I really don’t want to say that this worked. I don’t want to praise this business model. \n\nIt worked.\n\nWhen the pandemic struck in 2020, Tahini’s only had three stores, all in London, Ontario. They’ve now increased that number ninefold, spreading all across southwestern Ontario. In early 2022 they claimed to have never drawn from their Bitcoin savings, but given their rate of expansion amid a time of increasing interest rates, inflation, and engaging in a nationwide dance with recession, I think it is reasonable to conclude that their Bitcoin savings have propelled their expansion.\n\nRenowned Harvard business professor Michael Porter suggested all businesses use a generic strategy, split along the lines of low-cost/high-cost and niche/focused. I’d like to suggest a fifth Porter generic strategy: fucked. Fucked up. Sick and twisted. The fucked strategy.\n\nBusinesses aren’t supposed to be able to explode because of memeing all their profits into Bitcoin. They’re supposed to grow based on genuine competitive advantage, well-structured operations, and strong market fit. And Tahini’s has those, sure, but simultaneously, their success is in no small part driven by memeing all of their profits into Bitcoin.\n\nTahini’s is what happens when you give r/wallstreetbets complete ownership of a restaurant chain. It is a monument to spite. It is a testament to “fuck it, we ball” as one of the strongest business strategies ever conceived.\n\nThey have pretty good shawarma, too.\n\n--postscript--\n\n1. At the time of writing, Bitcoin was at $47,778.53 CAD. One bitcoin paying for chicken shawarma wraps ($11.99 \\* 1.13 HST) comes out to 3526.4291039 chicken shawarma wraps.\n2. They always maintain enough Canadian currency in their account to operate for the next 3-6 months. Beyond that? Any earnings they make become Bitcoin.\n","is someone who enforces his view\n\n> with the point of a blade.  \n\nand someone who lived and breathed UW for a third\n\n> of his thinking life, \n\nsomeone integrated with our culture, our campus, our way.\n\n> their product, completely \n\nit’s someone this university is responsible for. someone this university had time to redirect, to reshape, to point \n\n> at better passions. when fell through any cracks, it is this university \n\n> that opened them. if he was isolated, the university's culture of \n\n> > fetishization \n\n> of self-harm[1] has pushed him. when he was hateful, it was this university that \n\n> never connected him.\n\n> we are all responsible for our own \n\n> > actions. his hateful acts \n\n> are his alone.\n\nbut he only graduated one month ago.\n\n> and we want to believe he was a fluke in the formula, \n\n> > we are all the rule\n\nbut I wonder \n\n> if we’ve built an environment where he is the rule, \n\nand you and i \n\n> are beautiful exceptions\n\n--postscript--\n\nOn June 28, 2023, an knife-wielding attacker stabbed several students and a professor at the University of Waterloo. He had graduated mere weeks prior.\n\n1. inspired by _hotfemoid_, who has put this into words i do not dare compete with. [https://hotfemoid.substack.com/p/believe-it-or-not-the-suicide-school](https://hotfemoid.substack.com/p/believe-it-or-not-the-suicide-school)\n","I’ve been thinking about this article for a while. There were two versions of it: this one, and the overdramatic version that only applies if you never come back.\n\nThis recipe isn’t a family recipe; it has no storied history, nor legends of being pulled from the clutches of oppression. It is entirely homegrown — the ingredients are all shared between St. Jacobs and the local T&T. I derived the recipe from a few online blogs, but for the most part it has come from a few seasons of experimentation and creativity only unlocked by finally living free. It is unique to this town, this home to which we always return.\n\nAnd it sounds like you will.\n\nMost recipes for tomato soup online require an assortment of canned tomatoes, diced tomatoes, crushed tomatoes, tomato paste, and every other tomato format short of ketchup. I didn’t really have the patience for that; Tomato soup should really only require one core ingredient: tomato. Sometimes, simpler is better.\n\nSo I'll try not to make this too long.\n\nFeel free to add the additional tomatostuffs back in if you feel there is something missing.\n\nLike a student concert without you there.\n\n### Important things to have\n\n- Around 8 small tomatoes, 4 medium tomatoes, or 2-3 really big tomatoes\n- 2 cups of chicken broth\n- \\(p\\) carrots\n- \\(q\\) cloves of garlic\n- 1 slice of an onion\n- 1 block of ramen noodles\n- A large pot\n\n### Recommendations:\n\n- Spices, especially black pepper\n- A small dash of sesame oil\n- 3 tbsp of Parmesan cheese\n- Around ¼ cup of chopped parsley\n\nStart by boiling the chicken broth and 2 cups of water in a large pot, and cut up all your tomatoes into small chunks. If you have a blender, feel free to blend the tomatoes to make that step easier. When the water comes to a boil, turn the burner down to medium-low, add your tomatoes, and start a timer for about 20–25 minutes. Stir occasionally, then cover the pot, taking a last look at your intact tomatoes and saying goodbye.\n\nWhen there’s a recognizable chance of goodbyes being extended, or final, it’s hard to find the words that fit.\n\nWhile the soup is cooking, chop up some cloves of garlic to taste and sprinkle them in. Chop up one slice of an onion, and chop or julienne a few carrots, adding them to the pot as you go. Add salt and spices according to taste: I’ve had luck with black pepper, paprika, and cinnamon, but any \\(n\\) spices from your cupboard are sure to work. This is also generally the point where I’ll add a dash of sesame oil — not much, lest it overwhelms the taste.\n\nMaybe I would have used more, but you were convincing when you said you’d be fine.\n\nAfter about 12 minutes, the tomato chunks should have started to melt into the soup. Squish any large tomato chunks with your utensil of choice to help them along the way, but let the soup continue to cook for its full duration. Once you’ve determined that the tomato is almost fully combined with the soup, add in any cheese and parsley you’d like. If adding noodles, drop in the block of noodles like a raft on the ocean and send it away.\n\nI hope you remain safe and sound in your travels across the sea.\n\nAfter letting the noodles cook for about 2–3 minutes, serve. Makes about 2–3 meals, but you can always think about changing the proportions.\n\nAnd I look forward to the day we all meet again.\n","Surviving through Waterloo can be a lonely, isolating experience.  The endless flywheel of lectures, tutorials, assignments, and midterms leaves too many of us drained entirely, bereft of the joys that once filled our lives.  There exists a haven where we can find these joys again. \n\nIt’s a place far from the pull of Waterloo.  Students’ boots are unfamiliar to its grounds; its doors revolve with the steps of our elders.  A student is unlikely to have any material call to it; no assignment, no chore, no hobby nor responsibility will ensnare you in its grasp.  The call may reach you nonetheless; if you hear, answer.  See.  Walk into the temple and look into its depths.  Fill your lungs with its ancient dust, the aroma of home, warmth, earth, and the smell of the dry morning sun.  See the walls rise into the distance, its rows of rough-hewn beams climbing into the sky not to reach it, only to touch.  Hear the preacher at its depths, his outstretched hands calloused by his familiarity, his sermons not in instructions but example.  Feel the pull of your heart as it follows this temple’s soul to the sky.  The temple is to no god and all of them; to no individual but all human empathy.  It is a place of help, of education; asking fathers to be our guide, to teach us the ancient craft of toil and love.  It is a monument to creation, to all that we may make of its materials. To boats for our travels, to houses for our families; to cribs for our children, and gifts for our friends.  It is empathy, love, and the tight-held embrace.\n\nIt is the lumber aisle of a hardware store.  It is a cathedral to a loving god.\n","There’s a bench outside Billy Bishop airport, at which you can sit with a granola bar and wait for your flight to land.  Sometimes you have a MATH 239 exam instead of a flight, but you can visit the bench anyway.\n\nI didn’t live in the GTA growing up.  Toronto wasn’t so far to be visited once in a lifetime, but more than twice a year was excess.  It was a special treat; consumed under the summer sun for a long-planned weekend away from home.  I’d never seen it during Christmas.\n\nIt’s Thursday night when I realize I would like to finally see it.  The Kitchener GO does not run on weekends, and the window of time to MATH 239, my subsequent exams, and immediately going back home is closing.  If I were to see Christmas in Toronto, it would have to be Friday, barely two waking hours away.  \n\nThe morning alarm brings only regret.  Why be here, awake, when rest is so near?  I prepare breakfast anyway.  I have the means to make pancakes—why be here, making normal weekday cereal and molasses-topped yogurt when I can reward myself for surviving the term?  I eat my cereal.  A new game update released the day before—why be here, walking out of my apartment at 8:05 AM, when I can have a slow morning playing video games after so many weeks without?  I leave for the train station.\n\nThe train is canceled, of course.  The trip just became substantially harder; why am I here, looking up alternate routes?  Why am I here, on a bus to Bramalea?  Why am I here, standing in the cold at Bramalea GO?  Why am I here, on a train to Union? \n\n_Why am I here?_\n\nI convinced myself that upon reaching Toronto, I would immediately head to the University of Toronto, hide away in a nice study space, and study graph theory surrounded by UofT students unaware they’d been infiltrated.  The university is dead north of Union Station, so I emerge onto Front St and head west.\n\nA little known fact about Billy Bishop airport is that it exists.  Another little known fact about Billy Bishop airport, located on Toronto Island, is that you can walk to it.  A tunnel runs under the lake at the island’s closest point to shore, under the stretch of water where the world’s least ambitious ferry daily spans a stretch of what cannot be more than one hundred fifty metres.  Deferring UofT for later, I follow the tunnel, not knowing why.  If the island was calling me, it called my legs only.\n\nI found a bench outside Billy Bishop airport, at which you can sit with a granola bar and wait for your flight to land.  Sometimes you have a MATH 239 exam instead of a flight, but you can visit the bench anyway.\n\nNothing about this was optimal.  If I was optimizing my studies, I could have just studied at CnD, fueling my studies with hot chocolate and samosas.  If I was optimizing my rest, I could have stayed home, slept in, and played games until sunset.  If I was optimizing for Christmas, I could have taken a bus back home to my family, been home for Christmas early, and come back Sunday night to finish my exams.  In no way was eating a granola bar outside Billy Bishop Airport an optimal choice.  It wasn’t on the list of optimal choices; it wasn’t on the list of choices to begin with.\n\nAbsurdity.  It follows neither rhyme nor reason, is by nature unexpectable, and is rarely the optimal choice of any timeframe.  No artificial intelligence optimizes for absurdity.  They have goals, metrics, Markov chains of possible outcomes all optimizing to some form of success—every decision is considered, rationalized, set upon a throne of logic and data points.  Artificial intelligence rejects absurdity by nature of its being.\n\nIf our lives can be replicated by an algorithm, can it be said that we are alive?\n\nWhen I came to Waterloo, I promised myself I would live.  I would finally break free of the comfortably lifeless subsistence my cornfield-enclosed suburbia offered, claiming instead the fundamental birthright: life.  But the quiet death of subsistence is not unique to my home.  It lurks in every shadow at Waterloo, every day you grind studying, every night you rest with the same lonely activities, every well-worn path you take to class, every optimal path you do on repeat.  Quiet death thrives amid the repeated pursuit of optimality.\n\nIf death thrives in optimality, then absurdity defines life.\n\nChase absurdity.  It is why we are here.\n\n--postscript--\n\nI did eventually reach UofT, although not a single note of MATH 239 studying was accomplished.  I did, however, accidentally find and enter Queen’s Park, experience many aspects of Toronto at Christmas, and walk enough steps that my phone and my legs believe I should be sedentary for the next week.\n","## Ingredients: \n\n- 1 cup of dried chickpeas\n- ½ cup of chopped red onion\n- ½ cup of parsley leaves\n- 7 screebles of cayenne pepper\n- 9 greebles of cinnamon\n- 4 cloves of garlic\n- 1 cup flour\n- 1 tbsp baking powder\n- 304 U.S. teaspoons of mistakes\n- Olive oil\n\nYou will need: A loaf pan or alternative inventive means of baking chickpeas, a knife and bowl, and self-loathing.\n\n## Steps:\n\n1. Rinse then soak the chickpeas for at least 24 hours before making the recipe. After the fourth hour, add ½ tsp of mistakes at every two-hour interval.\n2. After a full day has passed, drain the chickpeas. Then, try to turn them into paste using nothing but a knife, your hands, and another 4 cups of mistakes. Should you succeed, immediately give up and find a real falafel recipe. Otherwise, when your arms are weak, your hands are shaky, your morale is broken, and your chickpeas resemble paste as much as they do a handful of pebbles, add another 2 cups of mistakes.\n3. Preheat your oven to 400°F.\n4. Combine the chickpea substance, chopped onion, parsley leaves, garlic, flour, baking powder, and spices in a large bowl. Mix very well.\n5. Transfer the chickpea mixture from the bowl into your baking dish, preferably a loaf pan. Remember to line the pan with parchment paper, or alternatively, another 2 tbsp of mistakes. Drizzle the mixture with some amount of olive oil.\n6. Bake for 40 minutes, until the point that some slight browning has occurred along the top of the mix, and your willpower has crumbled to dust.\n7. Remove from the oven. Sprinkle with broken dreams. Serve :)\n\nIf everything has gone well you'll have ~~a very tasty absolute crumbled mess that in no way resembles the original intention~~ falafel :)\n","Screams.\n\nAstaroth would have lost track of time without them.  Their regularity helped him stay focused.  Presiding over the Pandemonic High Court of Appeal never required much mental effort.  The screams were the only thing keeping his heart in it.\n\nThey died out.  Astaroth pushed the oversized brimstone lever attached to his royal armrest back into position; with a great screeching, the round, vaulted courtroom’s central trapdoor slowly sealed out the brilliant glow of the Lake of Fire bubbling below, returning the chamber to its regular crimson shadow.  When the court’s cacophony finally fell to silence, the colossal cast iron doors to the chamber creaked open, revealing a small form, naught but a silhouette of a hunched man dwarfed against the outer chamber’s golden-orange light.  \n\nNAME? rumbled the grizzled cyclops directing tonight's inquisitions.  \n\nThe man croaked out a name.\n\nPROCEED.\n\nWith a gulp, the old man crept forward to the central trapdoor, and in a weak voice, pleaded.\n\n“Sir, Mister Judge, sir, members of the jury, sirs, I think you’ve got the wrong man.  I’ve been a devout Catholic all my life, you see.  Was raised to respect God, prayed every night, always said Grace.  I did all the right things, and, and I just don’t see how I’ve ended up here.”\n\nThe courtroom fell to silence, and now Astaroth began to listen.  Soon it began.\n\n_DID YOU… PRACTICE… LENT?_ groaned a rock-covered troll.\n\nThe man held his ground.  “Mister Troll, I promise you I did, sir.  Every year of my life.”\n\nThe courtroom fell silent.  A many-eyed beholder cried out,\n\n_YOU ARE TATTOOED! _\n\nThe man met several of his eyes.  “I do sir, many tattoos, but all of them devoted to God, that’s condoned sir.”\n\nThe deals-demon, of course, saw this as a challenge.\n\n_You’ve the eyes of a farmer.  Have you ever… mixed your crops?_\n\nHe had not.  On the inquisition went, grilling the old man on every small detail of the Big Book.  Astaroth zoned in and out of the conversation; the jury could be trusted to handle this themselves, they weren’t wrong often.  Finally,\n\n_You did go to church, yes?_ inquired a green-skinned goblin.\n\n“Yes ma’am, every Sunday we went to church, me and my dear Maria, even through the pandemic we were there in the online—”\n\nAstaroth pulled the lever.  The trapdoor fell open.  Screams.\n\nThe man should have known.  The Lake would enjoy his bones, Astaroth was sure.\n\nThe jury’s celebratory cacophony drowned out the screams as the trapdoor slowly resealed.  Soon, the courtroom fell to silence again, and the next applicant was sent in.  A young woman stood before the court, and the inquisition began again.  \n\n_Did you wash your hands before and after eating?_ cried out a pale banshee.  She had.\n\n_Did you practice astrology?_ croaked a broad-winged drake.  She would never.\n\n_Were you slothful?_ snarled a night hag.  She was not.  She told the jury of the many small businesses she founded, the organizations she assisted, the charitable work she did in life.  The woman was very proud.  Too proud.\n\nAstaroth pulled the lever.  The trapdoor fell open.  Screams.\n\nAstaroth didn’t revel in his work.  Some thought his work even harmful—on the street corners of Pandemonium, a collective of succubi had taken to preaching that the High Court of Appeal was becoming overzealous in its rejections.  They never gained much traction.\n\nThe courtroom reset, and the next applicant came in.  The young man started his argument before reaching the trapdoor.  The cyclops demanded that the man correct his mistake; he was kind enough to oblige.  He tried then to continue his opening argument.\n\nAstaroth pulled the lever.  The trapdoor fell open.  Screams.\n\nIt was ultimately the chimeras who took up the succubi’s cause successfully.  Rather than lament about human suffering, the chimeras noted that primarily-pure souls committed to the Lake of Fire tainted its flames, eventually beginning to cool the Lakeside capital city of Pandemonium if too many pure souls were cast in.\n\nThe next applicant failed to get through his opening argument before using a High One’s name in vain.  \n\nAstaroth pulled the lever.  The trapdoor fell open.  Screams.\n\nWith enough careful conversation and swaying of public opinion, soon even the greater demons had grown concerned with the rate of corruption of the Lake.  The archdemons accepted mass casualties to the Blood War every day, but danger to their own citadels in the capital they could not abide.  Lucifer had had no choice but to order Astaroth to address the concerns, lest he allow an uprising to emerge from the fear gripping the streets.\n\nAnother.  Astaroth pulled the lever.  The trapdoor fell open.  Screams.\n\nFifteen more years, Astaroth pleaded.  By 2035, he would rebuild the High Court to be more careful in its processing; it could be no sooner, the court was so stuck in its ways.  Even the banshees ceased wailing when they heard his commitment; all demons of pandemonium were satisfied, save for the chimeras’ incessant nattering about ‘delay’ and ‘not nearly enough to cool the lake.’  He ought to have them tossed into the Lake.\n\nAstaroth pulled the lever.  Screams.\n\nDid they have a point?  At the current rate, he was processing an average of one applicant every sixty seconds.  If he multiplied that by sixty seconds per minute, sixty minutes per hour, thirty-six hours per day, then weeks, then months?  \n\nOne more soul wouldn’t corrupt the lake.  Nor would two.  Nor three.  Why should the Lake be his concern anyway?\n\nAstaroth pulled the lever.\n","My friend,\n\nI hope things are well at home.  All is well here, far outside the walls.  Within the heart of a heart, I’ve found a hidden balcony from which I write you now.  On Monday, I’ll gather with new friends and contribute this letter to mathNEWS—devoid of math and news, of course.  I hope you don’t mind if other people read it; I hope you’ll find someone to read it to you.\n\nThat Monday, we’ll gather to be together, catch up with old friends, and maybe make new ones.  We’ll translate heartbeats into words, gather for pizza under the evening sky, then thrive brightly hours into the night, before eventually drifting apart, back home, back to bed, forty thousand students filling maybe five streets.\n\nDo they remember when it was not this way?  \n\nFrom the Kitchener GO, a single set of tracks leads one hundred kilometers to a city, not three but one, that some of them call home. Outside the reach of its starlight is nothing, a shroud of darkness by night and void by day, which hides deep within a silent cluster of homes, a community in size, a cemetery in character.  They do not have mathNEWS meetings on Mondays.\n\nWe grew up in one such town, you and I.  It is surrounded on all sides, enclosed entirely by imposing walls of trees and sky, or fields and streams narrow enough to see the other side, but wide enough we could only yearn to cross.  From the center, we could run for only twenty minutes before finding ourselves bouncing off of the boundary, off of the river or field or highway, the ever-present bounds we used to call home.  You still do; it is not so small for you.  \n\nThe night only tightened its chains; the enclosure, once stretching to the great rivers and fields, contracted inwards to the four walls of our home—its edges now enforced not by space but by the coyote’s midnight lullaby.\n\nOne such night, you and I were left alone, told to lock the doors and seal ourselves away, because no one would do it for us.  One such night, you and I did not.\n\nSo we walked through the lightless night, twenty minutes in a single direction—it could have been ten, but you walk slowly; there is so much to smell.  Alone, we reached the main artery that led to the boundary; alone, we strode its lamplit runway; alone, we reached its border, unseen, unimpeded—there were no ION crossings to block our way.\n\nAt the border we found Nothing. Hiding under the intersection’s red and verdant neon glow, we could not see the trees across that intersection, nor the highways we took to school, nor the bridge we crossed to our families’ homes.  That night, we found nothing there but Nothing, a filled world hidden by that black wall, a blank canvas we could fill with naught but our silent hearts.\n\nWhat would it be to live in a heart?  To pass through this Nothing, discovering within the beating core of an unsleeping greater creation?  To live within it, to experience amid ten thousand other souls, connected by naught but existing together, here, the same endless lightning of life joining our veins.  What would it be to share in their life, to live without bounds; to walk their roads or ride together along them, to eat their food from one thousand places we’ve never seen; to experience every moment amid an orchestra of others—others’ lives, others’ passions, others’ hearts.  What would it be for every night to be a new adventure, for every stone to be unturned, for every street to hold another story, for every group to play a different tune, for every beat to come together to shout to the world our rebellious song: we’re alive, we’re alive, we’re alive.\n\n_Would someone please show me what it would be to be ALIVE?_\n\nThere is a tug at the rope on my hand.  I yearn into the dark edges of our tomb, but their silence has grown boring, and you are returning home.   \n\nThe next month I did not return with you.  I am finally alive, and the world is so bright.\n\nI wish you were here to see it with me.\n","## What libraries/packages were used to make this?\n\nThe code was written in TypeScript, to allow for better debugging and overall tighter code.\n\nNo other libraries were used in this project.\n\n## Design\n\nThis is my second attempt at creating a Pac-Man game to upload to this portfolio. The first version is coming soon - I still need to re-upload it to this new iteration of my website.\n\nYou can immediately spot a few differences, including the graphics and the 'High Scores' feature. Looking at the\ncode, the differences become far starker.\n\nThe old version of Pac-Man was my third code project. Ever. Due to my inexperience at the time, I had put all of\nmy code in one JavaScript file.\n\nThere was no class-based architecture, minimal comments anywhere (to my great dismay later on), and many other\ndesign decisions that I still cannot figure out the logic behind.\n\nIn terms of navigation, the old version was using a repurposed collision structure I had built for the [Mario](/work/game/luigi) game.\nThe characters' movement was based on whether they had walls in their way\n&#8212; if there was a wall, the character could not move in that direction, otherwise, they could.\n\nThis worked perfectly fine while the character moved at 1 pixel/second. However, once they sped up, the\nnavigation system began to break. Ghosts and players would often try to turn at an intersection and fail, which\nproved to severely hinder gameplay.\n\n![](/works/games/pacman-2/images/writeup/pacman-pre-hall.png)\n[caption](In this frame, Pac-Man is approaching the intersection. If he travels at 1px/second, he will reach the intersection next frame and be able to turn.)\n\n![](/works/games/pacman-2/images/writeup/pacman-past-hall.png)\n[caption](However, if he is moving at **2px/second**, he will pass by the intersection, never turning no matter how much the player tries, since he is _always touching a wall_.)\n\nHence, Pac-Man Version 2 implements an entirely different navigation strategy: a graph of nodes. Instead of\ndeciding whether the character can move based on whether they are touching a wall, the characters' movements\nare based on whether there is a _path_ in that direction.\n\n![](/works/games/pacman-2/images/writeup/node-map.png)\n[caption](The node-based navigation structure of Pac-Man Version 2.)\n\nThis means that, looking at the code, one can see that _there are no walls_. The walls no longer exist in\nthis version of the code &#8212; there are only paths.\n\n![](/works/games/pacman-2/images/writeup/node-map-no-walls.png)\n[caption](Even with the walls removed, the game works as normal.)\n\nThis approach has resolved the navigation problems, and improved gameplay immensely.\n","## What is it?\n\nThis program models the spread of an infectious disease in a local community (e.g. workplace, neighbourhood).\n\n## Is it accurate?\n\nMaybe! The bouncing of dots is probably not a perfect model of how infectious diseases spread, but it does provide an interesting visual nonetheless.\n\n## Can I change it?\n\nYes! Under the \"controls\" tab, one can alter the _infection details_ and _anti-infection measures_ in place against the infection. When you press _restart simulation_, the model will use your new parameters.\n\n## There is a single green dot bouncing around my screen\n\nWhoops! It appears that the person who brought the virus into this community didn't interact with anyone; hence, did not spread the virus.\n\nPress _restart simulation_ in the controls tab to try again.\n\n## The chart scrollbar is stuck\n\nThis is intentional, in order to show the most up-to-date data onscreen. To allow scrolling, check _unlock chart_ under _shown statistics_.\n\n## What external code libraries were used to make this?\n\nOriginally? None! HTML canvas and the built-in Math library can be surprisingly powerful tools.\n\nI later added TypeScript in 2021, and then moved the original HTML to React in early 2025. The core code is still untouched though.\n","The game above is level 1-1 of the original Super Mario Bros. It is the second programming project I ever made - the first, [Lunar Defense](/work/game/lunar-defence), you can also find on this site.\n\nI fear the code it took to make this work. On the upside, it's very easy to port to a new website. However, this is because the entire game was written in one, hulking, 3200-line long `<script>` element. If I remember correctly, this was all originally included directly in the HTML file; I didn't even put it in its own .js file at first. I hadn't heard of TypeScript yet - for that matter, I barely knew what an object was. The `class` keyword didn't appear even once; instead, I constructed objects using a 450-line function setting `this` attributes left and right. The documentation is non-existent, the sprite-switching code is 400 lines of conditional statement spaghetti, and the sheer amount of computations happening to each entity every frame cause the game - originally built for NES hardware - to begin to stutter.\n\nIt works though.\n\nThat's what I appreciate about this game most. Despite my complete lack of experience, I still managed to pull off a reasonably accurate replica of the first level of Mario. I must have watched videos of the original game over a hundred times, trying to get the various animations frame-perfect. Mario's momentum was another challenge; a relatively higher-level problem that required tons of fine-tuning to get to work accurately to the original. Even the firework animation at the end of the level, which you can trigger by the same little-known mechanic from the original NES game, I managed to port over.\n\nFifteen-year-old me managed to do all of this without knowing about `class`. For that matter, I barely even knew what a `canvas` was. The canvas code was ripped direct from a [w3schools graphics tutorial](https://www.w3schools.com/graphics/tryit.asp?filename=trygame_canvas) I hardly understood. And I _still_ made it work.\n\nThis isn't the sort of project I'd put on my resume. It is, however, one I remain proud of. In part, it's due to how well the final product holds up. In part, it's because I'm proud that I managed to do it at all.\n","This little project is the first game I ever made. It's just over 500 lines of pure JavaScript. I think it was meant to be the first part in a series of space-themed games I would assemble together at some point?\n\nThe graphics are simple JavaScript canvas, based on the starter code from [w3schools](https://www.w3schools.com/graphics/tryit.asp?filename=trygame_canvas). I'd continue to use this starter code for a lot of my initial games, customizing and rewriting parts of it as I grew to understand what it was doing, until the canvas code I'd use in later games became unrecognizable from its humble beginnings.\n\nA few funny quirks about this game. First, you may notice some amount of flashing, in particular whenever the player sprite changes. This is because on every sprite change, the site calls the image to be loaded from the server anew. There's no caching of any sort. On a small game like this, that actually wasn't so bad, but once I started becoming more ambitious on my next project, [the first level of Mario](/work/game/luigi), it didn't scale.\n\nAnother interesting quirk is that `Date.now()`, the fundamental function you need for any sort of live time tracking in JavaScript, is never called by this program. You may be wondering, \"how, then, is the timer going up onscreen?\" The answer is frame counting. I created a `frameNumber` variable, and incremented it on every single frame refresh. I had used a `setInterval` call to make the game update approximately every 16 ms. Then, I could reverse-engineer the seconds elapsed since game start using `frameNumber / 60`. This worked really well on my PC! Does it work when you have Chrome's memory saver enabled? Does it work on older computers, or in any environment not capable of the 16ms frame refresh? don't worry about it :)\n"]