[{"location":"writing-database\\mathnews\\v156\\i1\\gespeg\\main.md","metadata":{"title":"the land they call Gespe'g: 1/3","subtitle":"beyond the Appalachian wall","date":"September 13 2024","tags":["writing","mathNEWS"]},"description":"At the eastern tip of the Gaspé Peninsula lies the small town of Percé. Long ago, it was a bustling hub of the fishing industry, with lobster trapping vessels arriving daily and trains rushing through the trees. The fish have left now, and the train line has been washed out for years, but the town,"},{"location":"writing-database\\mathnews\\v156\\i2\\gespeg\\main.md","metadata":{"title":"the land they call Gespe'g: 2/3","subtitle":"lessons in the ancient east","date":"September 27 2024","tags":["writing","mathNEWS"]},"description":"Beyond the Appalachian mountains, there’s a small fishing town called Percé. The roads to it are long and treacherous, and once you’re there, you're as trapped as the lobsters of old. The town leaves you only one thing to do.  Listen."},{"location":"writing-database\\mathnews\\v156\\i3\\gespeg\\main.md","metadata":{"title":"the land they call Gespe'g: 3/3","subtitle":"the Hall","date":"October 11 2024","tags":["writing","mathNEWS"]},"description":"Picture a Hall. Not a hall, but a Hall. Capital H. In my imagining, it's one well-maintained deep room, with black-clothed tables set throughout. The walls are soft white, there's few windows, but there's pictures instead: each one a wintry landscape—in some, there's even a deer. In one corner of"},{"location":"writing-database\\mathnews\\v156\\i4\\uncapturable\\main.md","metadata":{"title":"under the uncapturable","date":"October 25 2024","tags":["writing","mathNEWS"]},"description":"Packed into a car, looking out over Columbia Lake, the black sky didn’t look that different. Streetlights dotted the landscape, trees stood out against the ambient glow; it was just that above, the clouds didn’t look right. Somehow, they were slightly too stretched. Almost smeared against the"},{"location":"writing-database\\mathnews\\v156\\i5\\noor-food-market\\main.md","metadata":{"title":"noor food market","subtitle":"on the nobility of trying","date":"November 5 2024","tags":["writing","mathNEWS"]},"description":"On Erb St W, halfway between University Ave and Fischer-Hallman, there’s an unremarkable one-story plaza you’ve probably passed before. Made of black siding above red bricks, it contains simple essentials: a variety store, a hair salon, an insurance agent, and more. It also contains two shops,"},{"location":"writing-database\\mathnews\\v156\\i6\\sinusoidal-soup\\main.md","metadata":{"title":"sinusoidal soup","date":"November 19 2024"},"description":"Ingredients    - some \\\\(n\\\\) tomatoes  - 1 chopped onion  - garlic, chopped  - spices?  - several hot peppers, chopped (e.g. jalapeños, chili peppers, whatever you can find really)  - an entire handful of cold herbs, chopped (e.g. basil, parsley, cilantro, mint)  - whatever else u want \\<3"},{"location":"writing-database\\mathnews\\v156\\i6\\the-last-rabbit\\main.md","metadata":{"title":"The Last Rabbit","date":"November 19 2024","tags":["writing","mathNEWS"]},"description":"The wildlife had left.    Few of the local housecats remember their time. Long ago, the valley was full of wild creatures. The raccoons, the turtles, the heron, and most importantly, the rabbit. None remain. None are remembered, etched into legends told at the housecats’ secret midnight meets."},{"location":"src\\app\\work\\game\\luigi\\page.tsx","metadata":{"title":"Mario 1-1","date":"Fall 2017","thumbnail":"public/works/games/luigi/images/thumbnail.png","tags":["game"]},"description":null}]